{"sentence_good": "Egia esateko, guri dena oso ondo irteten ari zaigu.", "sentence_bad": "Egia esateko, guri dena oso ondo irteten ari gara.", "sentence_good_reorder": "Egia esateko, guri oso ondo irteten ari zaigu dena.", "sentence_bad_reorder": "Egia esateko, guri oso ondo irteten ari gara dena.", "type": "E2: Aditza"}
{"sentence_good": "Amonaren urtebetetzea aste gutxi barru izango da, beraz jai berezia antolatzen ari naiz.", "sentence_bad": "Amonaren urtebetetzea aste gutxi barru izango da, beraz jai berezi antolatzen ari naiz.", "sentence_good_reorder": "Aste gutxi barru izango da amonaren urtebetetzea, beraz jai berezia antolatzen ari naiz.", "sentence_bad_reorder": "Aste gutxi barru izango da amonaren urtebetetzea, beraz jai berezi antolatzen ari naiz.", "type": "E1: Deklinabidea"}
{"sentence_good": "Arazoa da, beti bezala, tokietara korrika joaten naizenez, gero denetatik gertatzen zaidala.", "sentence_bad": "Arazoa da, beti bezala, tokietara korrika joaten naizenez, gero denetatik gertatzen zait.", "sentence_good_reorder": "Arazoa da, beti bezala, tokietara korrika joaten naizenez, denetatik gertatzen zaidala gero.", "sentence_bad_reorder": "Arazoa da, beti bezala, tokietara korrika joaten naizenez, denetatik gertatzen zait gero.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Psikiatrari esker, neure burua zentratzen ikasi, LH modulua gainditzea lortu, eta lan ona aurkitu nuen.", "sentence_bad": "Psikiatrari esker, nire burua zentratzen ikasi, LH modulua gainditzea lortu, eta lan ona aurkitu nuen.", "sentence_good_reorder": "Neure burua zentratzen ikasi, LH modulua gainditzea lortu, eta lan ona aurkitu nuen psikiatrari esker.", "sentence_bad_reorder": "Nire burua zentratzen ikasi, LH modulua gainditzea lortu, eta lan ona aurkitu nuen psikiatrari esker.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Oso egun ona izatea espero dut.", "sentence_bad": "Oso ona egun izatea espero dut.", "sentence_good_reorder": "Espero dut oso egun ona izatea.", "sentence_bad_reorder": "Oso ona egun izatea espero dut.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Egun osoa pasatu genuen itsasoan, igeri egiten, arrantzatzen, eta abar... ikusi dudan lekurik politena eta zoragarriena da.", "sentence_bad": "Egun osoa pasatu ginen itsasoan, igeri egiten, arrantzatzen, eta abar... Ikusi dudan lekurik politena eta zoragarriena da.", "sentence_good_reorder": "Itsasoan pasatu genuen egun osoa, igeri egiten, arrantzatzen, eta abar... ikusi dudan lekurik politena eta zoragarriena da.", "sentence_bad_reorder": "Itsasoan pasatu ginen egun osoa, igeri egiten, arrantzatzen, eta abar... ikusi dudan lekurik politena eta zoragarriena da.", "type": "E2: Aditza"}
{"sentence_good": "Hala, eramaten dituzten jabeei 100 euroko isuna jartzekotan gelditu omen dira azken udalbatzarrean.", "sentence_bad": "Hala, eramaten dituzten jabeei 100 euroko isuna jartzekotan gelditu omen dute azken udalbatzarrean.", "sentence_good_reorder": "Hala, azken udalbatzarrean 100 euroko isuna jartzekotan gelditu omen dira eramaten dituzten jabeei.", "sentence_bad_reorder": "Hala, azken udalbatzarrean 100 euroko isuna jartzekotan gelditu omen dute eramaten dituzten jabeei.", "type": "E2: Aditza"}
{"sentence_good": "Amaiak Turismo Ikasketak egin ditu ezta?", "sentence_bad": "Amaiak Turismo Ikasketak egin du ezta?", "sentence_good_reorder": "Turismo ikasketak egin ditu Amaiak ezta?", "sentence_bad_reorder": "Turismo ikasketak egin du Amaiak ezta?", "type": "E2: Aditza"}
{"sentence_good": "Ni Australian nago, Melbournen.", "sentence_bad": "Ni Australian zaude, Melbournen.", "sentence_good_reorder": "Australian nago ni, Melbournen.", "sentence_bad_reorder": "Australian zaude ni, Melbournen.", "type": "E2: Aditza"}
{"sentence_good": "Urtaro honetan hondartzara joan daiteke eta oso eguraldi ona egiten du.", "sentence_bad": "Urtaro honetan hondartzara joan daiteke eta oso ona eguraldi egiten du.", "sentence_good_reorder": "Hondartzara joan daiteke urtaro honetan eta oso eguraldi ona egiten du.", "sentence_bad_reorder": "Urtaro honetan hondartzara joan daiteke eta oso ona eguraldi egiten du.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gaur goizean Facebook-ek zure urtebetetze eguna dela abisatu dit, nahiz eta banekien.", "sentence_bad": "Gaur goizean Facebook-ek zure urtebetetze eguna dela abisatu zait, nahiz eta banekien.", "sentence_good_reorder": "Zure urtebetetze eguna dela abisatu dit Facebook-ek gaur goizean, nahiz eta banekien.", "sentence_bad_reorder": "Zure urtebetetze eguna dela abisatu zait Facebook-ek gaur goizean, nahiz eta banekien.", "type": "E2: Aditza"}
{"sentence_good": "Gaur egun, hainbat faktorek familia bat hasteko epea luzatu egin dute.", "sentence_bad": "Gaur egun, hainbat faktorek familia bat hasteko epea luzatu egin du.", "sentence_good_reorder": "Gaur egun, familia bat hasteko epea luzatu egin dute hainbat faktorek.", "sentence_bad_reorder": "Gaur egun, familia bat hasteko epea luzatu egin du hainbat faktorek.", "type": "E2: Aditza"}
{"sentence_good": "Horrez gain, gure herriak bi festa garrantzitsu ditu: bata, enpanadaren festa.", "sentence_bad": "Horrez gain, gure herria bi festa garrantzitsu ditu: bata, enpanadaren festa.", "sentence_good_reorder": "Horrez gain, bi festa garrantzitsu ditu gure herriak: bata, enpanadaren festa.", "sentence_bad_reorder": "Horrez gain, bi festa garrantzitsu ditu gure herria: bata, enpanadaren festa.", "type": "E1: Deklinabidea"}
{"sentence_good": "Hau da, 30 urterekin etxebizitza erosten baduzu, 80 urterekin amaituko duzu kredituaren ordainketa, eta horren ondorioz, batzuetan oinordekoek ordaindu beharko dute kreditua.", "sentence_bad": "Hau da, 30 urterekin etxebizitza erosten baduzu, 80 urterekin amaituko duzu kredituen ordainketa, eta horren ondorioz, batzuetan oinordekoek ordaindu beharko dute kreditua.", "sentence_good_reorder": "Hau da, 30 urterekin etxebizitza erosten baduzu, kredituaren ordainketa 80 urterekin amaituko duzu, eta horren ondorioz, batzuetan oinordekoek ordaindu beharko dute kreditua.", "sentence_bad_reorder": "Hau da, 30 urterekin etxebizitza erosten baduzu, kredituen ordainketa 80 urterekin amaituko duzu, eta horren ondorioz, batzuetan oinordekoek ordaindu beharko dute kreditua.", "type": "E1: Deklinabidea"}
{"sentence_good": "Neska oso argia da eta kurtsoak nahiko ondo gainditzen ditu.", "sentence_bad": "Neska oso argia da eta nahiko ondo kurtsoak gainditzen ditu.", "sentence_good_reorder": "Oso neska argia da eta kurtsoak nahiko ondo gainditzen ditu.", "sentence_bad_reorder": "Neska oso argia da eta nahiko ondo kurtsoak gainditzen ditu.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Garai hartan heziketak zorrotza eta gogorra izan behar zuela uste zuten.", "sentence_bad": "Garai hartan heziketak zorrotza eta gogorra behar izan zuela uste zuten.", "sentence_good_reorder": "Garai hartan uste zuten heziketak zorrotza eta gogorra izan behar zuela.", "sentence_bad_reorder": "Garai hartan heziketak zorrotza eta gogorra behar izan zuela uste zuten.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gaur egungo gizartean ezin ditugu garai hartako tomateak dastatu; hala ere, ez dugu gosea ezagutu.", "sentence_bad": "Gaur egungo gizartean ezin dugu garai hartako tomateak dastatu; hala ere, ez dugu gosea ezagutu.", "sentence_good_reorder": "Ezin ditugu garai hartako tomateak dastatu gaur egungo gizartean; hala ere, ez dugu gosea ezagutu.", "sentence_bad_reorder": "Ezin dugu garai hartako tomateak dastatu gaur egungo gizartean; hala ere, ez dugu gosea ezagutu.", "type": "E2: Aditza"}
{"sentence_good": "Egia da aldaketa guztiak zailak direla bereganatzeko hasiera batean, baina gure erantzukizuna da aldaketa horiek guztiak ezagutzea eta aztertzea.", "sentence_bad": "Egia da aldaketa guztiak zailak direla bereganatzeko hasiera batean, baina gure erantzukizuna da aldaketa hori guztiak ezagutzea eta aztertzea.", "sentence_good_reorder": "Egia da hasiera batean aldaketa guztiak zailak direla bereganatzeko, baina gure erantzukizuna da aldaketa horiek guztiak ezagutzea eta aztertzea.", "sentence_bad_reorder": "Egia da hasiera batean aldaketa guztiak zailak direla bereganatzeko, baina gure erantzukizuna da aldaketa hori guztiak ezagutzea eta aztertzea.", "type": "E1: Deklinabidea"}
{"sentence_good": "Beraz, behar duguna trebetasunak lantzea da, eta ez buruz ikastea bakarrik.", "sentence_bad": "Beraz, behar duguna trebetasunak lantzea da, eta ez buruz ikasten bakarrik.", "sentence_good_reorder": "Beraz, trebetasunak lantzea da behar duguna, eta ez buruz ikastea bakarrik.", "sentence_bad_reorder": "Beraz, trebetasunak lantzea da behar duguna, eta ez buruz ikasten bakarrik.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Pedrok esan zidan berak atzerrian lan egiten duela.", "sentence_bad": "Pedrok esan zidan berak atzerrian lan egiten dela.", "sentence_good_reorder": "Pedrok esan zidan berak atzerrian egiten duela lan.", "sentence_bad_reorder": "Pedrok esan zidan berak atzerrian egiten dela lan.", "type": "E2: Aditza"}
{"sentence_good": "Dirudienez badakite zer gertatu den eta antza denez eguzki-panelekin zerikusia du.", "sentence_bad": "Dirudienez badakite zer gertatu da eta antza denez eguzki-panelekin zerikusia du.", "sentence_good_reorder": "Dirudienez badakite zer gertatu den eta antza denez eguzki-panelekin du zerikusia.", "sentence_bad_reorder": "Dirudienez badakite zer gertatu da eta antza denez eguzki-panelekin du zerikusia.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Badakizue amonak dantzatzen eta kantatzen dakiela.", "sentence_bad": "Badakizue amonak dantzatzen eta kantatzen dakien.", "sentence_good_reorder": "Badakizue dantzatzen eta kantatzen dakiela amonak.", "sentence_bad_reorder": "Badakizue dantzatzen eta kantatzen dakien amonak.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Beraz, ni aukerak bilatzen hasi nintzen Interneten.", "sentence_bad": "Beraz, ni aukerak bilatzen hasi nuen Interneten.", "sentence_good_reorder": "Beraz, ni Interneten hasi nintzen aukerak bilatzen.", "sentence_bad_reorder": "Beraz, ni Interneten hasi nuen aukerak bilatzen.", "type": "E2: Aditza"}
{"sentence_good": "Ez dakit ziur non galdu dudan maleta, eguerdiko ordu batean nasan galdu ahal izan dut edo ordu bata eta erdietan metroko bigarren bagoian galdu ahal izan dut.", "sentence_bad": "Ez dakit ziur non galdu dut maleta, eguerdiko ordu batean nasan galdu ahal izan dut edo ordu bata eta erdietan metroko bigarren bagoian galdu ahal izan dut.", "sentence_good_reorder": "Ez dakit ziur maleta non galdu dudan, eguerdiko ordu batean nasan galdu ahal izan dut edo ordu bata eta erdietan metroko bigarren bagoian galdu ahal izan dut.", "sentence_bad_reorder": "Ez dakit ziur maleta non galdu dut, eguerdiko ordu batean nasan galdu ahal izan dut edo ordu bata eta erdietan metroko bigarren bagoian galdu ahal izan dut.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Nire herriaz galdetzen didazu.", "sentence_bad": "Nire herritaz galdetzen didazu.", "sentence_good_reorder": "Galdetzen didazu nire herriaz.", "sentence_bad_reorder": "Galdetzen didazu nire herritaz.", "type": "E1: Deklinabidea"}
{"sentence_good": "Hemen eguraldia oso ona da eta jendea oso jatorra da, baina oso zaila da beraiekin moldatzea.", "sentence_bad": "Hemen eguraldi oso ona da eta jendea oso jatorra da, baina oso zaila da beraiekin moldatzea.", "sentence_good_reorder": "Hemen oso ona da eguraldia eta jendea oso jatorra da, baina oso zaila da beraiekin moldatzea.", "sentence_bad_reorder": "Hemen oso ona da eguraldi eta jendea oso jatorra da, baina oso zaila da beraiekin moldatzea.", "type": "E1: Deklinabidea"}
{"sentence_good": "Zelan zaude Alicanten?", "sentence_bad": "Zelan zaude Alicantean?", "sentence_good_reorder": "Alicanten zelan zaude?", "sentence_bad_reorder": "Alicantean zelan zaude?", "type": "E1: Deklinabidea"}
{"sentence_good": "Ez baikenuen dei gehiagorik jaso, hilabetea amaitu arte.", "sentence_bad": "Ez baikenuen gehiago deirik jaso, hilabetea amaitu arte.", "sentence_good_reorder": "Dei gehiagorik ez baikenuen jaso, hilabetea amaitu arte.", "sentence_bad_reorder": "Deirik gehiago ez baikenuen jaso, hilabetea amaitu arte.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Bi irakasle oso zorrotz izan nituen.", "sentence_bad": "Oso bi irakasle zorrotz izan nituen.", "sentence_good_reorder": "Izan nituen bi irakasle oso zorrotz.", "sentence_bad_reorder": "Oso bi irakasle zorrotz izan nituen.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Mutila Mirenen koinatua zen.", "sentence_bad": "Mutilak Mirenen koinatua zen.", "sentence_good_reorder": "Mirenen koinatua zen mutila.", "sentence_bad_reorder": "Mirenen koinatua zen mutilak.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ikastaro honek online ikasteko metodoa erabiltzen du eta bere programa oso interesgarria da.", "sentence_bad": "Ikastaro hau online ikasteko metodoa erabiltzen du eta bere programa oso interesgarria da.", "sentence_good_reorder": "Online ikasteko metodoa erabiltzen du ikastaro honek eta bere programa oso interesgarria da.", "sentence_bad_reorder": "Online ikasteko metodoa erabiltzen du ikastaro hau eta bere programa oso interesgarria da.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nire alaba ere atzerrira joan zen, gure esperientziaren berri emango dizut, beharbada, lasaituko zaitu.", "sentence_bad": "Nire alaba ere atzerrira joan zen, gure esperientziaren berri emango dizut, beharbada, lasaitzen zaitu.", "sentence_good_reorder": "Nire alaba ere atzerrira joan zen, emango dizut gure esperientziaren berri, beharbada, lasaituko zaitu.", "sentence_bad_reorder": "Nire alaba ere atzerrira joan zen, emango dizut gure esperientziaren berri, beharbada, lasaitzen zaitu.", "type": "E2: Aditza"}
{"sentence_good": "Hemen eguraldia apur bat beroa eta hezea da, baina horregatik natura zoragarria da!", "sentence_bad": "Hemen eguraldia apur bat beroa eta heze da, baina horregatik natura zoragarria da!", "sentence_good_reorder": "Hemen eguraldia apur bat beroa eta hezea da, baina horregatik da natura zoragarria!", "sentence_bad_reorder": "Hemen eguraldia apur bat beroa eta heze da, baina horregatik da natura zoragarria!", "type": "E1: Deklinabidea"}
{"sentence_good": "Jatetxe horretan geratuko gara.", "sentence_bad": "Jatetxe horretan geratuko dugu.", "sentence_good_reorder": "Geratuko gara jatetxe horretan.", "sentence_bad_reorder": "Geratuko dugu jatetxe horretan.", "type": "E2: Aditza"}
{"sentence_good": "Horregatik, gaua iragan genuen mendian.", "sentence_bad": "Horregatik, gaua iragan ginen mendian.", "sentence_good_reorder": "Horregatik, mendian iragan genuen gaua.", "sentence_bad_reorder": "Horregatik, mendian iragan ginen gaua.", "type": "E2: Aditza"}
{"sentence_good": "Gainera, gazte elkarteko kideok proba diseinatzen joan gintezke urtean zehar.", "sentence_bad": "Gainera, gazte elkarteko kideok proba diseinatzen joan ginateke urtean zehar.", "sentence_good_reorder": "Gainera, proba diseinatzen joan gintezke urtean zehar gazte elkarteko kideok.", "sentence_bad_reorder": "Gainera, proba diseinatzen joan ginateke urtean zehar gazte elkarteko kideok.", "type": "E2: Aditza"}
{"sentence_good": "Ez ahaztu oso ugalkorrak direla eta erraz kutsatzen direla ile mota guztietan.", "sentence_bad": "Ez ahaztu oso ugalkorrak direla eta erraz kutsatzen dira ile mota guztietan.", "sentence_good_reorder": "Ez ahaztu oso ugalkorrak direla eta ile mota guztietan erraz kutsatzen direla.", "sentence_bad_reorder": "Ez ahaztu oso ugalkorrak direla eta ile mota guztietan erraz kutsatzen dira.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Korporazioak azterketak egiteko eta azterketako materialak saltzeko interes bakarra izaten du.", "sentence_bad": "Korporazioak azterketak egiteko eta azterketako materialak saltzeko interes bakarra izaten da.", "sentence_good_reorder": "Azterketak egiteko eta azterketako materialak saltzeko interes bakarra izaten du korporazioak.", "sentence_bad_reorder": "Azterketak egiteko eta azterketako materialak saltzeko interes bakarra izaten da korporazioak.", "type": "E2: Aditza"}
{"sentence_good": "Arratsaldean nahiago du, baina oraindik ezin izan diot txartela erosi.", "sentence_bad": "Arratsaldean nahiago du, baina oraindik ezin izan dizkiot txartela erosi.", "sentence_good_reorder": "Nahiago du arratsaldean, baina oraindik ezin izan diot txartela erosi.", "sentence_bad_reorder": "Nahiago du arratsaldean, baina oraindik ezin izan dizkiot txartela erosi.", "type": "E2: Aditza"}
{"sentence_good": "Autoaren goiko aldea zulatu egin zenez, autoa tailerrean dago geroztik.", "sentence_bad": "Autoaren goiko aldea zulatu egin zenez, autoa tailerrean darama geroztik.", "sentence_good_reorder": "Autoaren goiko aldea zulatu egin zenez, tailerrean dago autoa geroztik.", "sentence_bad_reorder": "Autoaren goiko aldea zulatu egin zenez, tailerrean darama autoa geroztik.", "type": "E2: Aditza"}
{"sentence_good": "Badakizue aurten lagunen afaria daukagula hurrengo hilabetean.", "sentence_bad": "Badakizue aurten lagunen afaria daukagu hurrengo hilabetean.", "sentence_good_reorder": "Badakizue lagunen afaria daukagula aurten hurrengo hilabetean.", "sentence_bad_reorder": "Badakizue lagunen afaria daukagu aurten hurrengo hilabetean.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ez neukan norekin hitz egin eta maisuek ez zuten ikusi nahi edo ez ziren konturatu zer gertatzen ari zen.", "sentence_bad": "Ez neukan norekin hitz egin eta maisuek ez zuten ikusi nahi edo ez ziren konturatu zer gertatzen ari zela.", "sentence_good_reorder": "Ez neukan norekin hitz egin eta maisuek ez zuten ikusi nahi edo ez ziren konturatu zer ari zen gertatzen.", "sentence_bad_reorder": "Ez neukan norekin hitz egin eta maisuek ez zuten ikusi nahi edo ez ziren konturatu zer ari zela gertatzen.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gutxitan nire lagunarekin kafe bat hartzen dut.", "sentence_bad": "Gutxitan nire lagunarekin kafe bat hartzen da.", "sentence_good_reorder": "Gutxitan hartzen dut kafe bat nire lagunarekin.", "sentence_bad_reorder": "Gutxitan hartzen da kafe bat nire lagunarekin.", "type": "E2: Aditza"}
{"sentence_good": "Hondartzara joango gara, baina gu ez gara bainatuko.", "sentence_bad": "Hondartzara joango gara, baina gu ez dugu bainatuko.", "sentence_good_reorder": "Joango gara hondartzara, baina gu ez gara bainatuko.", "sentence_bad_reorder": "Joango gara hondartzara, baina gu ez dugu bainatuko.", "type": "E2: Aditza"}
{"sentence_good": "Normalean ez dago aparkalekurik, jendea ospitalera etortzen delako, medikuarengana edo lan egitera.", "sentence_bad": "Normalean ez dago aparkalekurik, jendea ospitalera etortzen direlako, medikuarengana edo lan egitera.", "sentence_good_reorder": "Ez dago aparkalekurik normalean, jendea ospitalera etortzen delako, medikuarengana edo lan egitera.", "sentence_bad_reorder": "Ez dago aparkalekurik normalean, jendea ospitalera etortzen direlako, medikuarengana edo lan egitera.", "type": "E2: Aditza"}
{"sentence_good": "Eta negua han oso hotza da.", "sentence_bad": "Eta negua han oso hotza dago.", "sentence_good_reorder": "Eta negua oso hotza da han.", "sentence_bad_reorder": "Eta negua oso hotza dago han.", "type": "E2: Aditza"}
{"sentence_good": "Garbitasun kontratua ere hobetzekoa da, azken urteotan garbitasuna ez delako lehen zen bezain ona.", "sentence_bad": "Garbitasun kontratua ere hobetzekoa da, azken urteotan garbitasuna ez delako lehen zen bezalako ona.", "sentence_good_reorder": "Garbitasun kontratua ere hobetzekoa da, garbitasuna ez delako lehen zen bezain ona azken urteotan.", "sentence_bad_reorder": "Garbitasun kontratua ere hobetzekoa da, garbitasuna ez delako lehen zen bezalako ona azken urteotan.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Arroza egiten den bitartean, moztu piperrak.", "sentence_bad": "Arroza egiten da bitartean, moztu piperrak.", "sentence_good_reorder": "Moztu piperrak, arroza egiten den bitartean.", "sentence_bad_reorder": "Moztu piperrak, arroza egiten da bitartean.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Hiruren artean, egokitzeko errazena lehenengoa dela deritzot eta honekin has gaitezke.", "sentence_bad": "Hiruren artean, egokitzeko errazena lehenengoa dela deritzot eta honekin hasi gaitezke.", "sentence_good_reorder": "Hiruren artean, lehenengoa dela egokitzeko errazena deritzot eta honekin has gaitezke.", "sentence_bad_reorder": "Hiruren artean, lehenengoa dela egokitzeko errazena deritzot eta honekin hasi gaitezke.", "type": "E2: Aditza"}
{"sentence_good": "Alde batetik, baratze ekologikoa landu bitartean, konpostari buruz ikastaroa egin liteke, hau da, ikasteaz gain praktikak egin genitzake eta beste ekimen bat egin liteke.", "sentence_bad": "Alde batetik, baratze ekologikoa landu bitartean, konpostari buruz ikastaroa egin liteke, hau da, ikasteaz gain praktikak egin genezake eta beste ekimen bat egin liteke.", "sentence_good_reorder": "Alde batetik, baratze ekologikoa landu bitartean, ikastaroa egin liteke konpostari buruz, hau da, ikasteaz gain praktikak egin genitzake eta beste ekimen bat egin liteke.", "sentence_bad_reorder": "Alde batetik, baratze ekologikoa landu bitartean, ikastaroa egin liteke konpostari buruz, hau da, ikasteaz gain praktikak egin genezake eta beste ekimen bat egin liteke.", "type": "E2: Aditza"}
{"sentence_good": "Herriak oso ondo hartuko luke erabaki hori.", "sentence_bad": "Herriak oso ondo hartu luke erabaki hori.", "sentence_good_reorder": "Erabaki hori oso ondo hartuko luke herriak.", "sentence_bad_reorder": "Erabaki hori oso ondo hartu luke herriak.", "type": "E2: Aditza"}
{"sentence_good": "Zuk badakizu nolakoa naizen jendearekin: alaia, atsegina eta oso berritsua.", "sentence_bad": "Zuk badakizu nolakoa naiz jendearekin: alaia, atsegina eta oso berritsua.", "sentence_good_reorder": "Zuk badakizu jendearekin nolakoa naizen: alaia, atsegina eta oso berritsua.", "sentence_bad_reorder": "Zuk badakizu jendearekin nolakoa naiz: alaia, atsegina eta oso berritsua.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gainditu nituen behingoz tristura eta bakardadea.", "sentence_bad": "Gainditu nuen behingoz tristura eta bakardadea.", "sentence_good_reorder": "Behingoz gainditu nituen tristura eta bakardadea.", "sentence_bad_reorder": "Behingoz gainditu nuen tristura eta bakardadea.", "type": "E2: Aditza"}
{"sentence_good": "Beraz, azken asteotan lan egin eta gero akademia batera joaten naiz, ekainean dauzkadan bi azterketak prestatzeko, jakina nekagarria dela!", "sentence_bad": "Beraz, azken asteotan lan egin eta gero akademia batera joaten naiz, ekainean dauzkadan bi azterketak prestatzeko, jakina nekagarria den!", "sentence_good_reorder": "Beraz, azken asteotan lan egin eta gero akademia batera joaten naiz, ekainean dauzkadan bi azterketak prestatzeko, jakina dela nekagarria!", "sentence_bad_reorder": "Beraz, azken asteotan lan egin eta gero akademia batera joaten naiz, ekainean dauzkadan bi azterketak prestatzeko, jakina den nekagarria!", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gaur Iparraldean nago eta oso polita da.", "sentence_bad": "Gaur Iparralde nago eta oso polita da.", "sentence_good_reorder": "Iparraldean nago gaur eta oso polita da.", "sentence_bad_reorder": "Iparralde nago gaur eta oso polita da.", "type": "E1: Deklinabidea"}
{"sentence_good": "Kasualitatez zure mezua jaso baino lehen nire poltsaren barruan ikusi dut eta konturatu naiz.", "sentence_bad": "Kasualitatez zure mezu jaso baino lehen nire poltsaren barruan ikusi dut eta konturatu naiz.", "sentence_good_reorder": "Zure mezua jaso baino lehen nire poltsaren barruan ikusi dut kasualitatez eta konturatu naiz.", "sentence_bad_reorder": "Zure mezu jaso baino lehen nire poltsaren barruan ikusi dut kasualitatez eta konturatu naiz.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ikaskide agurgarriak: Gutun honen bidez ez dut nire orbainak kentzea espero, baina nik esango dizuedanak beste ume batek oinazerik jasan ez dezan balio izango balu, nahikoa litzateke niretzat.", "sentence_bad": "Ikaskide agurgarriak: Gutun honen bidez ez dut nire orbainak kentzea espero, baina nik esango dizuenak beste ume batek oinazerik jasan ez dezan balio izango balu, nahikoa litzateke niretzat.", "sentence_good_reorder": "Ikaskide agurgarriak: Gutun honen bidez ez dut espero nire orbainak kentzea, baina nik esango dizuedanak beste ume batek oinazerik jasan ez dezan balio izango balu, nahikoa litzateke niretzat.", "sentence_bad_reorder": "Ikaskide agurgarriak: Gutun honen bidez ez dut espero nire orbainak kentzea, baina nik esango dizuenak beste ume batek oinazerik jasan ez dezan balio izango balu, nahikoa litzateke niretzat.", "type": "E2: Aditza"}
{"sentence_good": "Hiriaren erritmoa azkar doa, han baino azkarrago.", "sentence_bad": "Hiriaren erritmoa azkar doa, han baino azkarragoa.", "sentence_good_reorder": "Azkar doa hiriaren erritmoa, han baino azkarrago.", "sentence_bad_reorder": "Azkar doa hiriaren erritmoa, han baino azkarragoa.", "type": "E1: Deklinabidea"}
{"sentence_good": "Gogoratzen duzu haien bizimoduak harritzen gintuenekoa?", "sentence_bad": "Gogoratzen duzu haien bizimoduak harritzen zigunean?", "sentence_good_reorder": "Haien bizimoduak harritzen gintuenekoa gogoratzen duzu?", "sentence_bad_reorder": "Haien bizimoduak harritzen zigunean gogoratzen duzu?", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Amaitzeko oso garrantzitsua da buelta ematea estalki edo plater batekin.", "sentence_bad": "Amaitzeko oso garrantzitsua da buelta eman estalki edo plater batekin.", "sentence_good_reorder": "Amaitzeko oso garrantzitsua da estalki edo plater batekin buelta ematea.", "sentence_bad_reorder": "Amaitzeko oso garrantzitsua da estalki edo plater batekin buelta eman.", "type": "E1: Deklinabidea"}
{"sentence_good": "Zaborrean harrapatuta geratzen dira edo plastikoa beste animaliekin nahasten dute eta jan egiten dute.", "sentence_bad": "Zaborran harrapatuta geratzen dira edo plastikoa beste animaliekin nahasten dute eta jan egiten dute.", "sentence_good_reorder": "Zaborrean geratzen dira harrapatuta edo plastikoa beste animaliekin nahasten dute eta jan egiten dute.", "sentence_bad_reorder": "Zaborran geratzen dira harrapatuta edo plastikoa beste animaliekin nahasten dute eta jan egiten dute.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nire bulegoa ez dago urrun eta oinez joan naiteke egunero.", "sentence_bad": "Nire bulegoa ez dago urrun eta oinez joan dezaket egunero.", "sentence_good_reorder": "Nire bulegoa ez dago urrun eta egunero oinez joan naiteke.", "sentence_bad_reorder": "Nire bulegoa ez dago urrun eta egunero oinez joan dezaket.", "type": "E2: Aditza"}
{"sentence_good": "Hobe hor ez baleude, baina niretzako sekula ez da izan arazo bat.", "sentence_bad": "Hobe hor ez baziren, baina niretzako sekula ez da izan arazo bat.", "sentence_good_reorder": "Hor ez baleude hobe, baina niretzako sekula ez da izan arazo bat.", "sentence_bad_reorder": "Hor ez baziren hobe, baina niretzako sekula ez da izan arazo bat.", "type": "E2: Aditza"}
{"sentence_good": "Kanpoan erabat ilun zegoen eta oso beldurgarria zen, baina atea itxi genuen, xedapenetako batzuk jan genituen, eta lotara joan ginen.", "sentence_bad": "Kanpoan erabat iluna zegoen eta oso beldurgarria zen, baina atea itxi genuen, xedapenetako batzuk jan genituen, eta lotara joan ginen.", "sentence_good_reorder": "Erabat ilun zegoen kanpoan eta oso beldurgarria zen, baina atea itxi genuen, xedapenetako batzuk jan genituen, eta lotara joan ginen.", "sentence_bad_reorder": "Erabat iluna zegoen kanpoan eta oso beldurgarria zen, baina atea itxi genuen, xedapenetako batzuk jan genituen, eta lotara joan ginen.", "type": "E1: Deklinabidea"}
{"sentence_good": "Zalantza gehiago badaukazu, mesedez jar zaitez nirekin harremanetan.", "sentence_bad": "Zalantza gehiago badaukazu, mesedez jarri zaitez nirekin harremanetan.", "sentence_good_reorder": "Zalantza gehiago badaukazu, mesedez nirekin harremanetan jar zaitez.", "sentence_bad_reorder": "Zalantza gehiago badaukazu, mesedez nirekin harremanetan jarri zaitez.", "type": "E2: Aditza"}
{"sentence_good": "Izan ere, hipotekaren munduan ere haiek nahi dutena egin dezakete eta hobeto datozkien baldintzak inposatzen dizkigute.", "sentence_bad": "Izan ere, hipotekaren munduan ere haiek nahi duena egin dezakete eta hobeto datozkien baldintzak inposatzen dizkigute.", "sentence_good_reorder": "Izan ere, haiek nahi dutena egin dezakete hipotekaren munduan ere eta hobeto datozkien baldintzak inposatzen dizkigute.", "sentence_bad_reorder": "Izan ere, haiek nahi duena egin dezakete hipotekaren munduan ere eta hobeto datozkien baldintzak inposatzen dizkigute.", "type": "E2: Aditza"}
{"sentence_good": "Mende erdi bateko epean, eroslea hil daiteke eta ordaindu gabe dauden kredituak eroslearen oinordekoei pasatzen zaizkie.", "sentence_bad": "Mende erdi bateko epean, eroslea hil daiteke eta ordaindu gabe dauden kredituak eroslearen oinordekoei pasatzen dira.", "sentence_good_reorder": "Mende erdi bateko epean, eroslea hil daiteke eta eroslearen oinordekoei pasatzen zaizkie ordaindu gabe dauden kredituak.", "sentence_bad_reorder": "Mende erdi bateko epean, eroslea hil daiteke eta eroslearen oinordekoei pasatzen dira ordaindu gabe dauden kredituak.", "type": "E2: Aditza"}
{"sentence_good": "Hori da hori arazoa han gertatzen ari dena!", "sentence_bad": "Hori arazoa da hori han gertatzen ari den!", "sentence_good_reorder": "Hori da arazoa hori han gertatzen ari dena!", "sentence_bad_reorder": "Hori arazoa da hori han gertatzen ari den!", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Bistan denez, hartutako neurri guztien aldekoa naiz.", "sentence_bad": "Bistan denez, hartutako neurri guztiaren aldekoa naiz.", "sentence_good_reorder": "Hartutako neurri guztien aldekoa naiz, bistan denez.", "sentence_bad_reorder": "Hartutako neurri guztiaren aldekoa naiz, bistan denez.", "type": "E1: Deklinabidea"}
{"sentence_good": "Zure amari esker jakin nuen autobus horretako helbidea Benidorm zela.", "sentence_bad": "Zure amari esker jakin nuen autobus horretako helbidea Benidorm zen.", "sentence_good_reorder": "Autobus horretako helbidea Benidorm zela zure amari esker jakin nuen.", "sentence_bad_reorder": "Autobus horretako helbidea Benidorm zen zure amari esker jakin nuen.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Pentsa ezazue nola sentituko zinateketen zuen seme-alaba bat-batean eta azalpenik gabe bere ikaskideen jazarpena jasaten hasiko balitz.", "sentence_bad": "Pentsa ezazue nola sentituko zinateketen zure seme-alaba bat-batean eta azalpenik gabe bere ikaskideen jazarpena jasaten hasiko balitz.", "sentence_good_reorder": "Pentsa ezazue zuen seme-alaba bat-batean eta azalpenik gabe bere ikaskideen jazarpena jasaten hasiko balitz nola sentituko zinateketen.", "sentence_bad_reorder": "Pentsa ezazue zure seme-alaba bat-batean eta azalpenik gabe bere ikaskideen jazarpena jasaten hasiko balitz nola sentituko zinateketen.", "type": "E1: Deklinabidea"}
{"sentence_good": "Beraz, norekin hitz egin behar dudan jakitea gustatuko litzaidake nire gastuak ordaintzeko edo nire fakturak bidaltzeko.", "sentence_bad": "Beraz, norekin hitz egin behar dut jakitea gustatuko litzaidake nire gastuak ordaintzeko edo nire fakturak bidaltzeko.", "sentence_good_reorder": "Beraz, gustatuko litzaidake norekin hitz egin behar dudan jakitea nire gastuak ordaintzeko edo nire fakturak bidaltzeko.", "sentence_bad_reorder": "Beraz, gustatuko litzaidake norekin hitz egin behar dut jakitea nire gastuak ordaintzeko edo nire fakturak bidaltzeko.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Argi dago galdara honek ez duela ezertarako balio, beraz, beste galdara bat nahi dut, dohainik, jakina.", "sentence_bad": "Argi dago galdara honek ez du ezertarako balio, beraz, beste galdara bat nahi dut, dohainik, jakina.", "sentence_good_reorder": "Galdara honek ez duela ezertarako balio argi dago, beraz, beste galdara bat nahi dut, dohainik, jakina.", "sentence_bad_reorder": "Galdara honek ez du ezertarako balio argi dago, beraz, beste galdara bat nahi dut, dohainik, jakina.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gainera, kontuan hartu behar da hirian hainbat unibertsitate-fakultate daudela.", "sentence_bad": "Gainera, kontuan hartu behar da hirian hainbat unibertsitate-fakultate daude.", "sentence_good_reorder": "Gainera, hirian hainbat unibertsitate-fakultate daudela hartu behar da kontuan.", "sentence_bad_reorder": "Gainera, hirian hainbat unibertsitate-fakultate daude hartu behar da kontuan.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gure ekonomiarentzat ere oso garrantzitsua da, batez ere bisitariak eta turistak etor daitezen nahi badugu.", "sentence_bad": "Gure ekonomiarentzat ere oso garrantzitsua da, batez ere bisitariak eta turistak etor dadin nahi badugu.", "sentence_good_reorder": "Gure ekonomiarentzat ere oso garrantzitsua da, bisitariak eta turistak etor daitezen nahi badugu batez ere.", "sentence_bad_reorder": "Gure ekonomiarentzat ere oso garrantzitsua da, bisitariak eta turistak etor dadin nahi badugu batez ere.", "type": "E2: Aditza"}
{"sentence_good": "Eta oraingoz besterik ez, laster berriro idaztea espero dut.", "sentence_bad": "Eta oraingoz besterik ez, laster idaztea berriro espero dut.", "sentence_good_reorder": "Eta oraingoz besterik ez, espero dut laster berriro idaztea.", "sentence_bad_reorder": "Eta oraingoz besterik ez, laster idaztea berriro espero dut.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Baina ez uste dena ona denik, osasungintza publikoan gauza txarrena itxarote-zerrenda da.", "sentence_bad": "Baina ez uste dena ona dela, osasungintza publikoan gauza txarrena itxarote-zerrenda da.", "sentence_good_reorder": "Baina ez uste dena ona denik, osasungintza publikoan itxarote-zerrenda da gauza txarrena.", "sentence_bad_reorder": "Baina ez uste dena ona dela, osasungintza publikoan itxarote-zerrenda da gauza txarrena.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Zer gustatzen zaigun eta zer ez argi uzteko.", "sentence_bad": "Zer gustatzen zaigu eta zer ez argi uzteko.", "sentence_good_reorder": "Argi uzteko zer gustatzen zaigun eta zer ez.", "sentence_bad_reorder": "Argi uzteko zer gustatzen zaigu eta zer ez.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Azken lau urteetan Michelinen lan egin dut.", "sentence_bad": "Azken lau urte Michelinen lan egin dut.", "sentence_good_reorder": "Azken lau urteetan Michelinen egin dut lan.", "sentence_bad_reorder": "Azken lau urte Michelinen egin dut lan.", "type": "E1: Deklinabidea"}
{"sentence_good": "Asteburuan libre badago, bi hilabetean behin etxea alokatzen dut naturaz gozatzeko.", "sentence_bad": "Asteburuan libre badago, bi hilabetean behin etxea alokatzen dut natura gozatzeko.", "sentence_good_reorder": "Asteburuan libre badago, bi hilabetean behin alokatzen dut etxea naturaz gozatzeko.", "sentence_bad_reorder": "Asteburuan libre badago, bi hilabetean behin alokatzen dut etxea natura gozatzeko.", "type": "E1: Deklinabidea"}
{"sentence_good": "Atzo gauean berak irrist egin zuen eta hanka bat apurtu zuen.", "sentence_bad": "Atzo gauean berak irrist egin du eta hanka bat apurtu zuen.", "sentence_good_reorder": "Atzo gauean irrist egin zuen berak eta hanka bat apurtu zuen.", "sentence_bad_reorder": "Atzo gauean irrist egin du berak eta hanka bat apurtu zuen.", "type": "E2: Aditza"}
{"sentence_good": "Ziur asko lan ona egingo duzu.", "sentence_bad": "Ziur asko lan ona egingo duzula.", "sentence_good_reorder": "Lan ona egingo duzu ziur asko.", "sentence_bad_reorder": "Lan ona egingo duzula ziur asko.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Beste aldetik, esan behar dizut musika ez dela, noski, desberdintasun bakarra edo desberdintasunik handiena.", "sentence_bad": "Beste aldetik, esan behar dizut musika ez da, noski, desberdintasun bakarra edo desberdintasunik handiena.", "sentence_good_reorder": "Beste aldetik, esan behar dizut ez dela musika, noski, desberdintasun bakarra edo desberdintasunik handiena.", "sentence_bad_reorder": "Beste aldetik, esan behar dizut ez da musika, noski, desberdintasun bakarra edo desberdintasunik handiena.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Esate baterako, egun batean istripu larri bat izango bazenu, zure mediku pribatuarengana joan beharrean, zuzenean bidaliko zintuzkete hurbileneko ospitale publikoko larrialdietara.", "sentence_bad": "Esate baterako, egun batean istripu larri bat izango bazenu, zure mediku pribatura joan beharrean, zuzenean bidaliko zintuzkete hurbileneko ospitale publikoko larrialdietara.", "sentence_good_reorder": "Esate baterako, egun batean istripu larri bat izango bazenu, zure mediku pribatuarengana joan beharrean, hurbileneko ospitale publikoko larrialdietara bidaliko zintuzkete zuzenean.", "sentence_bad_reorder": "Esate baterako, egun batean istripu larri bat izango bazenu, zure mediku pribatura joan beharrean, hurbileneko ospitale publikoko larrialdietara bidaliko zintuzkete zuzenean.", "type": "E1: Deklinabidea"}
{"sentence_good": "Eta hamasei urte bete arte bi gauzak egiten jarraitzen nuen.", "sentence_bad": "Eta hamasei urte bete arte bi gauzak egiten jarraitzen nintzen.", "sentence_good_reorder": "Eta bi gauzak egiten jarraitzen nuen hamasei urte bete arte.", "sentence_bad_reorder": "Eta bi gauzak egiten jarraitzen nintzen hamasei urte bete arte.", "type": "E2: Aditza"}
{"sentence_good": "Ez dakit zure herrian gertatzen den, baina hemen dagoeneko kontsulta batzuk ere eten dira.", "sentence_bad": "Ez dakit zure herrian gertatzen denik, baina hemen dagoeneko kontsulta batzuk ere eten dira.", "sentence_good_reorder": "Ez dakit gertatzen den zure herrian, baina hemen dagoeneko kontsulta batzuk ere eten dira.", "sentence_bad_reorder": "Ez dakit gertatzen denik zure herrian, baina hemen dagoeneko kontsulta batzuk ere eten dira.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gure herria Bizkaian kokatuta dago, Bilbotik zazpi kilometrora baino ez dago, eta kostaldera iristeko distantzia bera dago.", "sentence_bad": "Gure herria Bizkaian kokatuta dago, Bilbotik zazpi kilometro baino ez dago, eta kostaldera iristeko distantzia bera dago.", "sentence_good_reorder": "Gure herria Bizkaian kokatuta dago, zazpi kilometrora baino ez dago Bilbotik, eta kostaldera iristeko distantzia bera dago.", "sentence_bad_reorder": "Gure herria Bizkaian kokatuta dago, zazpi kilometro baino ez dago Bilbotik, eta kostaldera iristeko distantzia bera dago.", "type": "E1: Deklinabidea"}
{"sentence_good": "Badakizue parasito hauek oso ugalkorrak direla eta laster zabaltzen direla.", "sentence_bad": "Badakizue parasito hauek oso ugalkorrak direla eta laster zabaltzen diren.", "sentence_good_reorder": "Badakizue oso ugalkorrak direla parasito hauek eta laster zabaltzen direla.", "sentence_bad_reorder": "Badakizue oso ugalkorrak direla parasito hauek eta laster zabaltzen diren.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gaur zure urtebetetzea da, beraz ZORIONAK ZURI!", "sentence_bad": "Gaur zure urtebetetze da, beraz ZORIONAK ZURI!", "sentence_good_reorder": "Zure urtebetetzea da gaur, beraz ZORIONAK ZURI!", "sentence_bad_reorder": "Zure urtebetetze da gaur, beraz ZORIONAK ZURI!", "type": "E1: Deklinabidea"}
{"sentence_good": "Badakit zure erabakia ez dela erraza, baina saiatuko naiz azaltzen zergatik den oso komenigarria gure egoitza.", "sentence_bad": "Badakit zure erabakia ez den erraza, baina saiatuko naiz azaltzen zergatik den oso komenigarria gure egoitza.", "sentence_good_reorder": "Badakit ez dela erraza zure erabakia, baina saiatuko naiz azaltzen zergatik den oso komenigarria gure egoitza.", "sentence_bad_reorder": "Badakit ez den erraza zure erabakia, baina saiatuko naiz azaltzen zergatik den oso komenigarria gure egoitza.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Luna nire txakurra da eta basora joaten gara egunero.", "sentence_bad": "Luna nire txakurra da eta basoara joaten gara egunero.", "sentence_good_reorder": "Luna nire txakurra da eta egunero joaten gara basora.", "sentence_bad_reorder": "Luna nire txakurra da eta egunero joaten gara basoara.", "type": "E1: Deklinabidea"}
{"sentence_good": "Eguzkia dagoenean, egun osoa hondartzan pasatzea gustatzen zait eta gero, etxera itzultzea, dutxa bat hartzea eta lagunekin afaltzera irtetea.", "sentence_bad": "Eguzkia dagoenean, egun osoa hondartzan pasatzea gustatzen zait eta gero, etxera itzultzea, dutxa bat hartzea eta lagunekin afaltzera irten.", "sentence_good_reorder": "Eguzkia dagoenean, egun osoa hondartzan pasatzea gustatzen zait eta gero, etxera itzultzea, dutxa bat hartzea eta afaltzera irtetea lagunekin.", "sentence_bad_reorder": "Eguzkia dagoenean, egun osoa hondartzan pasatzea gustatzen zait eta gero, etxera itzultzea, dutxa bat hartzea eta afaltzera irten lagunekin.", "type": "E1: Deklinabidea"}
{"sentence_good": "Haien ustez, suaren arrazoiak ez dira batere argiak.", "sentence_bad": "Haien ustez, suaren arrazoiak ez daudela batere argiak.", "sentence_good_reorder": "Haien ustez, ez dira batere argiak suaren arrazoiak.", "sentence_bad_reorder": "Haien ustez, ez daudela batere argiak suaren arrazoiak.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Lagun batek bazekien gailurrean ermita bat zegoela eta han bertan erabaki genuen gaua pasatzea.", "sentence_bad": "Lagun batek banekien gailurrean ermita bat zegoela eta han bertan erabaki genuen gaua pasatzea.", "sentence_good_reorder": "Lagun batek gailurrean ermita bat zegoela bazekien eta han bertan erabaki genuen gaua pasatzea.", "sentence_bad_reorder": "Lagun batek gailurrean ermita bat zegoela banekien eta han bertan erabaki genuen gaua pasatzea.", "type": "E2: Aditza"}
{"sentence_good": "Hala eta guztiz ere, kultur eskaintza hobetu daiteke.", "sentence_bad": "Hala eta guztiz ere, kultur eskaintza hobetu litzake.", "sentence_good_reorder": "Hala eta guztiz ere, hobetu daiteke kultur eskaintza.", "sentence_bad_reorder": "Hala eta guztiz ere, hobetu litzake kultur eskaintza.", "type": "E2: Aditza"}
{"sentence_good": "Euren argudioa oso erraza da: animaliek hondartzan egoteko eskubide berdinak dituzte eta ez dago besterik.", "sentence_bad": "Euren argudioa oso erraza da: animaliak hondartzan egoteko eskubide berdinak dituzte eta ez dago besterik.", "sentence_good_reorder": "Euren argudioa oso erraza da: animaliek eskubide berdinak dituzte hondartzan egoteko eta ez dago besterik.", "sentence_bad_reorder": "Euren argudioa oso erraza da: animaliak eskubide berdinak dituzte hondartzan egoteko eta ez dago besterik.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nik uste dut oso oreka ona daukadala.", "sentence_bad": "Nik uste dut oso ona oreka daukadala.", "sentence_good_reorder": "Oso oreka ona daukadala uste dut nik.", "sentence_bad_reorder": "Oso ona oreka daukadala uste dut nik.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Eskerrik asko eta musu ezti bat denontzat.", "sentence_bad": "Eskerrik asko eta musu ezti bat denorentzat.", "sentence_good_reorder": "Eskerrik asko eta denontzat musu ezti bat.", "sentence_bad_reorder": "Eskerrik asko eta denorentzat musu ezti bat.", "type": "E1: Deklinabidea"}
{"sentence_good": "Lagun batek zure eztei-agentzia gomendatu zigun.", "sentence_bad": "Lagun batek zure eztei-agentzia gomendatu zenigun.", "sentence_good_reorder": "Zure eztei agentzia gomendatu zigun lagun batek.", "sentence_bad_reorder": "Zure eztei agentzia gomendatu zenigun lagun batek.", "type": "E2: Aditza"}
{"sentence_good": "Zorionak zure urtebetetzean.", "sentence_bad": "Zorionak zure urtebetetzea.", "sentence_good_reorder": "Zure urtebetetzean zorionak.", "sentence_bad_reorder": "Zure urtebetetzea zorionak.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nire hirira itzuli nintzenean konturatu nintzen zein erraza den gure bizitza hemen.", "sentence_bad": "Nire hirira itzuli nintzenean konturatu nintzen zein erraza da gure bizitza hemen.", "sentence_good_reorder": "Nire hirira itzuli nintzenean konturatu nintzen gure bizitza hemen zein erraza den.", "sentence_bad_reorder": "Nire hirira itzuli nintzenean konturatu nintzen gure bizitza hemen zein erraza da.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Espero dut hona laster etortzea.", "sentence_bad": "Espero dut hona laster etortea.", "sentence_good_reorder": "Hona laster etortzea espero dut.", "sentence_bad_reorder": "Hona laster etortea espero dut.", "type": "E1: Deklinabidea"}
{"sentence_good": "Hondartza asko daude guztientzat, txakurrekin eta txakurrik gabe.", "sentence_bad": "Hondartza asko daude guztientzat, txakurrekin eta txakurrak gabe.", "sentence_good_reorder": "Guztientzat hondartza asko daude guztientzat, txakurrekin eta txakurrik gabe.", "sentence_bad_reorder": "Guztientzat hondartza asko daude, txakurrekin eta txakurrak gabe.", "type": "E1: Deklinabidea"}
{"sentence_good": "Biztanleriari dagokionez, herri txikia dela esan dezakegu, bost mila biztanle baino gutxiago daude erroldatuta.", "sentence_bad": "Biztanleria dagokionez, herri txikia dela esan dezakegu, bost mila biztanle baino gutxiago daude erroldatuta.", "sentence_good_reorder": "Herri txikia dela esan dezakegu biztanleriari dagokionez, bost mila biztanle baino gutxiago daude erroldatuta.", "sentence_bad_reorder": "Herri txikia dela esan dezakegu biztanleria dagokionez, bost mila biztanle baino gutxiago daude erroldatuta.", "type": "E1: Deklinabidea"}
{"sentence_good": "Normalean, entsalada saltxitxekin edo zopa bazkaltzen dugu.", "sentence_bad": "Normalean, entsalada saltxitxekin edo zopa bazkaltzen ari gara.", "sentence_good_reorder": "Entsalada saltxitxekin edo zopa bazkaltzen dugu normalean.", "sentence_bad_reorder": "Entsalada saltxitxekin edo zopa bazkaltzen ari gara normalean.", "type": "E2: Aditza"}
{"sentence_good": "Oso eskola zaharra zen, ehun urte baino gehiago zeuzkan zegoeneko garai hartan, baina jendea oso atsegina zen eta lagun asko egin nituen eskolan nengoenean.", "sentence_bad": "Oso eskola zaharra zen, ehun baino gehiago urte zeuzkan zegoeneko garai hartan, baina jendea oso atsegina zen eta lagun asko egin nituen eskolan nengoenean.", "sentence_good_reorder": "Oso eskola zaharra zen, garai hartan ehun urte baino gehiago zeuzkan zegoeneko, baina jendea oso atsegina zen eta lagun asko egin nituen eskolan nengoenean.", "sentence_bad_reorder": "Oso eskola zaharra zen, garai hartan ehun baino gehiago urte zeuzkan zegoeneko, baina jendea oso atsegina zen eta lagun asko egin nituen eskolan nengoenean.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Baina nire etxera bidali nahi badidazue, nire helbidea maletan idatzita dago, barruan, plastiko laranja batean.", "sentence_bad": "Baina nire etxera bidaltzen nahi badidazue, nire helbidea maletan idatzita dago, barruan, plastiko laranja batean.", "sentence_good_reorder": "Baina nire etxera bidali nahi badidazue, maletan idatzita dago nire helbidea, barruan, plastiko laranja batean.", "sentence_bad_reorder": "Baina nire etxera bidaltzen nahi badidazue, maletan idatzita dago nire helbidea, barruan, plastiko laranja batean.", "type": "E2: Aditza"}
{"sentence_good": "Bere familiak diru asko zeukan eta Florenziako eskolarik onenean ikasi ahal izan zuen.", "sentence_bad": "Bere familiak asko diru zeukan eta Florenziako eskolarik onenean ikasi ahal izan zuen.", "sentence_good_reorder": "Diru asko zenkan bere familiak eta Florenziako eskolarik onenean ikasi ahal izan zuen.", "sentence_bad_reorder": "Asko diru zeukan bere familiak eta Florenziako eskolarik onenean ikasi ahal izan zuen.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Esan dudanez, ekintza berriak egin genitzake, horregatik proposamen bat egin nahiko nuke: Euskal Herriko ibai baten ura aztertzea.", "sentence_bad": "Esan dudanez, ekintza berriak egin genituzke, horregatik proposamen bat egin nahiko nuke: Euskal Herriko ibai baten ura aztertzea.", "sentence_good_reorder": "Esan dudanez, ekintza berriak egin genitzake, proposamen bat egin nahiko nuke horregatik: Euskal Herriko ibai baten ura aztertzea.", "sentence_bad_reorder": "Esan dudanez, ekintza berriak egin genituzke, proposamen bat egin nahiko nuke horregatik: Euskal Herriko ibai baten ura aztertzea.", "type": "E2: Aditza"}
{"sentence_good": "Egun horretan nire nebari operazioa egingo diote eta berarekin gaua pasatu beharko dut ospitalean.", "sentence_bad": "Egun horretan nire nebari operazioa egingo diote eta berarekin gauan pasatu beharko dut ospitalean.", "sentence_good_reorder": "Egun horretan operazioa egingo diote nire nebari eta berarekin gaua pasatu beharko dut ospitalean.", "sentence_bad_reorder": "Egun horretan operazioa egingo diote nire nebari eta berarekin gauan pasatu beharko dut ospitalean.", "type": "E1: Deklinabidea"}
{"sentence_good": "Baina ez dakizue zer gertatu zitzaigun atzo!", "sentence_bad": "Baina ez dakizue zer gertatu ginen atzo!", "sentence_good_reorder": "Baina ez dakizue atzo zer gertatu zitzaigun!", "sentence_bad_reorder": "Baina ez dakizue atzo zer gertatu ginen!", "type": "E2: Aditza"}
{"sentence_good": "Hauei aurrekoan ordubete inguru kostatu zitzaien guregana iristea.", "sentence_bad": "Hauei aurrekoan ordubete inguru kostatu zaie guregana iristea.", "sentence_good_reorder": "Hauei ordubete inguru kostatu zitzaien aurrekoan guregana iristea.", "sentence_bad_reorder": "Hauei ordubete inguru kostatu zaie aurrekoan guregana iristea.", "type": "E2: Aditza"}
{"sentence_good": "Datorren astean ikusiko dugu elkar.", "sentence_bad": "Datorren astean ikusiko gara elkar.", "sentence_good_reorder": "Datorren astean elkar ikusiko dugu.", "sentence_bad_reorder": "Datorren astean elkar ikusiko gara.", "type": "E2: Aditza"}
{"sentence_good": "Hau da, gobernuak debekatu beharko luke bidegabekeria hau eta justiziaren alde jokatu, behartsuenei lagunduz eta pobrezia handitzea eragotziz.", "sentence_bad": "Hau da, gobernuak debekatu beharko lituzke bidegabekeria hau eta justiziaren alde jokatu, behartsuenei lagunduz eta pobrezia handitzea eragotziz.", "sentence_good_reorder": "Hau da, gobernuak bidegabekeria hau debekatu beharko luke eta justiziaren alde jokatu, behartsuenei lagunduz eta pobrezia handitzea eragotziz.", "sentence_bad_reorder": "Hau da, gobernuak bidegabekeria hau debekatu beharko lituzke eta justiziaren alde jokatu, behartsuenei lagunduz eta pobrezia handitzea eragotziz.", "type": "E2: Aditza"}
{"sentence_good": "Hau guztia kontuan hartzen badugu, generoaren berdintasunaren alde ekintza txiki bat egingo dugu eta gizartea hobetzeko ekintza bat sortzen ari garela uste dut.", "sentence_bad": "Guzti hau kontuan hartzen badugu, generoaren berdintasunaren alde ekintza txiki bat egingo dugu eta gizartea hobetzeko ekintza bat sortzen ari garela uste dut.", "sentence_good_reorder": "Hau guztia hartzen badugu kontuan, generoaren berdintasunaren alde ekintza txiki bat egingo dugu eta gizartea hobetzeko ekintza bat sortzen ari garela uste dut.", "sentence_bad_reorder": "Guzti hau hartzen badugu kontuan, generoaren berdintasunaren alde ekintza txiki bat egingo dugu eta gizartea hobetzeko ekintza bat sortzen ari garela uste dut.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Oso ondo nago Alemanian, baina gogo handia daukat zuek ikusteko.", "sentence_bad": "Oso ondo nago Alemanian, baina gogo handia daukat zuen ikusteko.", "sentence_good_reorder": "Oso ondo nago Alemanian, baina zuek ikusteko gogo handia daukat.", "sentence_bad_reorder": "Oso ondo nago Alemanian, baina zuen ikusteko gogo handia daukat.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ni ez naiz gogoratzen Kuban non bizi zaren.", "sentence_bad": "Ni ez naiz gogoratzen Kuban non bizi zara.", "sentence_good_reorder": "Kuban non bizi zaren ez naiz gogoratzen ni.", "sentence_bad_reorder": "Kuban non bizi zara ez naiz gogoratzen ni.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ikastaroa Sodupeko kiroldegian izaten da, kiroldegi hau nire herritik hurbil dago, hamabi kilometrora dago.", "sentence_bad": "Ikastaroa Sodupeko kiroldegian izaten da, kiroldegi hau nire herriaren hurbil dago, hamabi kilometrora dago.", "sentence_good_reorder": "Ikastaroa Sodupeko kiroldegian izaten da, kiroldegi hau hurbil dago nire herritik, hamabi kilometrora dago.", "sentence_bad_reorder": "Ikastaroa Sodupeko kiroldegian izaten da, kiroldegi hau hurbil dago nire herriaren, hamabi kilometrora dago.", "type": "E1: Deklinabidea"}
{"sentence_good": "Izan ere, han izugarrizko eskaintzak izango ditut, egundoko artistak ezagutuko ditut, mundu osoko jendearekin harremanetan egongo naiz.", "sentence_bad": "Izan ere, han izugarrizko eskaintzak izango ditut, egundoko artistak ezagutuko ditut, mundu osoaren jendearekin harremanetan egongo naiz.", "sentence_good_reorder": "Izan ere, han izugarrizko eskaintzak izango ditut, egundoko artistak ezagutuko ditut, harremanetan egongo naiz mundu osoko jendearekin.", "sentence_bad_reorder": "Izan ere, han izugarrizko eskaintzak izango ditut, egundoko artistak ezagutuko ditut, harremanetan egongo naiz mundu osoaren jendearekin.", "type": "E1: Deklinabidea"}
{"sentence_good": "Gaur egun, generoaren ikuspegitik jendartean sortu den eztabaidari erantzunez, zuen kezka oso normala da eta garrantzi handia daukala uste dut.", "sentence_bad": "Gaur egun, generoaren ikuspegitik jendartean sortu duen eztabaidari erantzunez, zuen kezka oso normala da eta garrantzi handia daukala uste dut.", "sentence_good_reorder": "Gaur egun, jendartean generoaren ikuspegitik sortu den eztabaidari erantzunez, zuen kezka oso normala da eta garrantzi handia daukala uste dut.", "sentence_bad_reorder": "Gaur egun, jendartean generoaren ikuspegitik sortu duen eztabaidari erantzunez, zuen kezka oso normala da eta garrantzi handia daukala uste dut.", "type": "E2: Aditza"}
{"sentence_good": "Orain dela hiru urte, nire familiarekin joan nintzen oporretan.", "sentence_bad": "Orain dela hiru urte, nire familiarekin nindoan oporretan.", "sentence_good_reorder": "Orain dela hiru urte, oporretan joan nintzen nire familiarekin.", "sentence_bad_reorder": "Orain dela hiru urte, oporretan nindoan nire familiarekin.", "type": "E2: Aditza"}
{"sentence_good": "Han ezagutu nuen jendeak nire amona gogorarazi zidan.", "sentence_bad": "Han ezagutu nuen jendea nire amona gogorarazi zidan.", "sentence_good_reorder": "Nire amona gogorarazi zidan han ezagutu nuen jendeak.", "sentence_bad_reorder": "Nire amona gogorarazi zidan han ezagutu nuen jendea.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ostatu hartzeko familia euskaldun baten bila nabil, herri txiki batean ideala izango da, euskal kulturatik gertuago egon ahal izateko eta nire tresnarik gogokoena landu ahal izateko, txalaparta, San Mameseko futbol partida batean haren soinua entzun nuenetik.", "sentence_bad": "Ostatu hartzeko familia euskaldun bat bila nabil, herri txiki batean ideala izango da, euskal kulturatik gertuago egon ahal izateko eta nire tresnarik gogokoena landu ahal izateko, txalaparta, San Mameseko futbol partida batean haren soinua entzun nuenetik.", "sentence_good_reorder": "Familia euskaldun baten bila nabil ostatu hartzeko, herri txiki batean ideala izango da, euskal kulturatik gertuago egon ahal izateko eta nire tresnarik gogokoena landu ahal izateko, txalaparta, San Mameseko futbol partida batean haren soinua entzun nuenetik.", "sentence_bad_reorder": "Familia euskaldun bat bila nabil ostatu hartzeko, herri txiki batean ideala izango da, euskal kulturatik gertuago egon ahal izateko eta nire tresnarik gogokoena landu ahal izateko, txalaparta, San Mameseko futbol partida batean haren soinua entzun nuenetik.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Zuk esan duzunaren ildotik, begien bistakoa da zure amak laguntza handia behar duela.", "sentence_bad": "Zuk esan duenaren ildotik, begien bistakoa da zure amak laguntza handia behar duela.", "sentence_good_reorder": "Zuk esan duzunaren ildotik, zure amak laguntza handia behar duela begien bistakoa da.", "sentence_bad_reorder": "Zuk esan duenaren ildotik, zure amak laguntza handia behar duela begien bistakoa da.", "type": "E2: Aditza"}
{"sentence_good": "Hala eta guztiz ere, produktu ekologikoak kontsumitzeko arrazoi ugari daude: osasungarriak dira, ez dute pestizidarik, ez dute gehigarri sintetikorik, ez antibiotikorik, ingurumenarekiko jasangarriak dira eta natura eta animaliak errespetatzen dituzte.", "sentence_bad": "Hala eta guztiz ere, produktu ekologikoak kontsumitzeko arrazoi ugari daude: osasungarriak dira, ez dute pestizidarik, ez dute gehigarri sintetikorik, ez antibiotikorik, ingurumenarekiko jasangarriak dira eta natura eta animaliak errespetatzen dute.", "sentence_good_reorder": "Hala eta guztiz ere, arrazoi ugari daude produktu ekologikoak kontsumitzeko: osasungarriak dira, ez dute pestizidarik, ez dute gehigarri sintetikorik, ez antibiotikorik, ingurumenarekiko jasangarriak dira eta natura eta animaliak errespetatzen dituzte.", "sentence_bad_reorder": "Hala eta guztiz ere, arrazoi ugari daude produktu ekologikoak kontsumitzeko: osasungarriak dira, ez dute pestizidarik, ez dute gehigarri sintetikorik, ez antibiotikorik, ingurumenarekiko jasangarriak dira eta natura eta animaliak errespetatzen dute.", "type": "E2: Aditza"}
{"sentence_good": "Gure bizitza osoan lanean egon gara, eta orain denbora daukagunez, aprobetxatu egin behar dugu!", "sentence_bad": "Gure bizitza osoan lanean egon gara, eta orain denbora daukagula, aprobetxatu egin behar dugu!", "sentence_good_reorder": "Lanean egon gara gure bizitza osoan lanean egon gara, eta orain denbora daukagunez, aprobetxatu egin behar dugu!", "sentence_bad_reorder": "Lanean egon gara gure bizitza osoan, eta orain denbora daukagula, aprobetxatu egin behar dugu!", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gaur egun, alabaina, mugimendu feminista dela eta, txarto ikusita dago.", "sentence_bad": "Gaur egun, alabaina, mugimendu feminista delarik, txarto ikusita dago.", "sentence_good_reorder": "Gaur egun, alabaina, txarto ikusita dago, mugimendu feminista dela eta.", "sentence_bad_reorder": "Gaur egun, alabaina, txarto ikusita dago, mugimendu feminista delarik.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Lehenengo bi orduak kentzea gustatuko litzaidake.", "sentence_bad": "Lehenengo bi ordu kentzea gustatuko litzaidake.", "sentence_good_reorder": "Gustatuko litzaidake lehenengo bi orduak kentzea.", "sentence_bad_reorder": "Gustatuko litzaidake lehenengo bi ordu kentzea.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ziur asko zuri gustatzen zaizu etxe hau, batez ere, kostaldean dagoelako, herri txikian.", "sentence_bad": "Ziur asko zu gustatzen zaizu etxe hau, batez ere, kostaldean dagoelako, herri txikian.", "sentence_good_reorder": "Ziur asko, batez ere, kostaldean dagoelako, herri txikian, gustatzen zaizu zuri etxe hau.", "sentence_bad_reorder": "Ziur asko, batez ere, kostaldean dagoelako, herri txikian, gustatzen zaizu zu etxe hau.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nik zer egiten dudan nire denbora librean?", "sentence_bad": "Nik zer egiten duzun nire denbora librean?", "sentence_good_reorder": "Zer egiten dudan nik nire denbora librean?", "sentence_bad_reorder": "Zer egiten duzun nik nire denbora librean?", "type": "E2: Aditza"}
{"sentence_good": "Egon ginen lekua izugarri polita zen.", "sentence_bad": "Leku egon ginela izugarri polita zen.", "sentence_good_reorder": "Izugarri polita zen egon ginen lekua.", "sentence_bad_reorder": "Izugarri polita zen leku egon ginela.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Taberna honetan hain zuzen, atzo pertsona arraro bat ezagutu genuen.", "sentence_bad": "Taberna honetan hain zuzen, atzo pertsona arraro bat ezagutzen genuen.", "sentence_good_reorder": "Atzo pertsona arraro bat ezagutu genuen, taberna honetan hain zuzen.", "sentence_bad_reorder": "Atzo pertsona arraro bat ezagutzen genuen, tabena honetan hain zuzen.", "type": "E2: Aditza"}
{"sentence_good": "Liherrek eta Unaxek oso antzeko jarrerak dituztenez, horregatik, galdetzeari ekin nion.", "sentence_bad": "Liherrek eta Unaxek oso antzeko jarrera dituztenez, horregatik, galdetzeari ekin nion.", "sentence_good_reorder": "Oso antzeko jarrerak dituztenez Liherrek eta Unaxek, horregatik, galdetzeari ekin nion.", "sentence_bad_reorder": "Oso antzeko jarrera dituztenez Liherrek eta Unaxek, horregatik, galdetzeari ekin nion.", "type": "E1: Deklinabidea"}
{"sentence_good": "Horren kariaz idazten dut artikulu hau.", "sentence_bad": "Horreen kariaz idazten dut artikulu hau.", "sentence_good_reorder": "Artikulu hau horren kariaz idazten dut.", "sentence_bad_reorder": "Artikulu hau horreen kariaz idazten dut.", "type": "E1: Deklinabidea"}
{"sentence_good": "Nire ustez, hainbat ibilbide markatu beharko lirateke, eta barbakoetarako guneak egokitu.", "sentence_bad": "Nire ustez, hainbat ibilbide markatu beharko lirateke, eta barbakoentzako guneak egokitu.", "sentence_good_reorder": "Nire ustez, hainbat ibilbide markatu, eta barbakoetarako guneak egokitu beharko lirateke.", "sentence_bad_reorder": "Nire ustez, hainbat ibilbide markatu, eta barbakoentzako guneak egokitu beharko lirateke.", "type": "E1: Deklinabidea"}
{"sentence_good": "Gu klasean 40 inguru ginen eta binaka esertzen ginen.", "sentence_bad": "Gu klasean 40ak inguruan ginen eta binaka esertzen ginen.", "sentence_good_reorder": "40 inguru ginen gu klasean eta binaka esertzen ginen.", "sentence_bad_reorder": "40ak inguruan ginen gu klasean eta binaka esertzen ginen.", "type": "E1: Deklinabidea"}
{"sentence_good": "Beti gogoratzen ditugu opor horiek eta asko gustatuko litzaiguke berriro joatea.", "sentence_bad": "Beti gogoratzen ditugu opor horiek eta asko gustatuko zaigun berriro joatea.", "sentence_good_reorder": "Opor horiek beti gogoratzen ditugu eta asko gustatuko litzaiguke berriro joatea.", "sentence_bad_reorder": "Opor horiek beti gogoratzen ditugu eta asko gustatuko zaigun berriro joatea.", "type": "E2: Aditza"}
{"sentence_good": "Nik errezeta berri batzuk sukaldatzeko joan behar izan nuen.", "sentence_bad": "Nik errezeta berri batzuk sukaldatzeko joan behar izan nituen.", "sentence_good_reorder": "Errezeta berri batzuk sukaldatzeko joan behar izan nuen nik.", "sentence_bad_reorder": "Errezeta berri batzuk sukaldatzeko joan behar izan nituen nik.", "type": "E2: Aditza"}
{"sentence_good": "Orain arte, gure hezkuntza-ereduan, ia dena buruz ikasi behar izaten zen.", "sentence_bad": "Orain arte, gure hezkuntza-ereduan, ia dena buruz ikasi behar izan zen.", "sentence_good_reorder": "Orain arte, gure hezkuntza-ereduan, buruz ikasi behar izaten zen ia dena.", "sentence_bad_reorder": "Orain arte, gure hezkuntza-ereduan, buruz ikasi behar izan zen ia dena.", "type": "E2: Aditza"}
{"sentence_good": "Agian batzuk bai eta beste batzuk oso zailak izango lirateke, nahiz eta ados egon zuzendariak proposatu duenarekin.", "sentence_bad": "Agian batzuk bai eta beste batzuk oso zailak izango litzatezke, nahiz eta ados egon zuzendariak proposatu duenarekin.", "sentence_good_reorder": "Agian batzuk bai eta beste batzuk oso zailak izango lirateke, nahiz eta zuzendariak proposatu duenarekin ados egon.", "sentence_bad_reorder": "Agian batzuk bai eta beste batzuk oso zailak izango litzatezke, nahiz eta zuzendariak proposatu duenarekin ados egon.", "type": "E2: Aditza"}
{"sentence_good": "Zuk dakizunez nire semeak leuzemia izan zuen.", "sentence_bad": "Zuk dakizuenez nire semeak leuzemia izan zuen.", "sentence_good_reorder": "Zuk dakizunez leuzemia izan zuen nire semeak.", "sentence_bad_reorder": "Zuk dakizuenez leuzemia izan zuen nire semeak.", "type": "E2: Aditza"}
{"sentence_good": "Taldean Ainhoa da beti esperimentuak egiten aritzen dena.", "sentence_bad": "Taldetik Ainhoa da beti esperimentuak egiten aritzen dena.", "sentence_good_reorder": "Ainhoa da taldean beti esperimentuak egiten aritzen dena.", "sentence_bad_reorder": "Ainhoa da taldetik beti esperimentuak egiten aritzen dena.", "type": "E1: Deklinabidea"}
{"sentence_good": "Lana goizeko ordutegian izango da eta zortziehun euro ordainduko dute hilero.", "sentence_bad": "Lana goizeko ordutegian izango da eta zortziehun euro ordaingo dute hilero.", "sentence_good_reorder": "Lana goizeko ordutegian izango da eta hilero zortziehun euro ordainduko dute.", "sentence_bad_reorder": "Lana goizeko ordutegian izango da eta hilero zortziehun euro ordaingo dute.", "type": "E2: Aditza"}
{"sentence_good": "Hori dela eta zuhaitz azpian gelditu ginen suhiltzaileak agertu ziren arte.", "sentence_bad": "Hori dela eta zuhaitz azpian gelditu genuen suhiltzaileak agertu ziren arte.", "sentence_good_reorder": "Hori dela eta suhiltzaileak agertu ziren arte zuhaitz azpian gelditu ginen.", "sentence_bad_reorder": "Hori dela eta suhiltzaileak agertu ziren arte zuhaitz azpian gelditu genuen.", "type": "E2: Aditza"}
{"sentence_good": "Buruz ikastean ez dituztela gaitasun asko garatzen uste dut.", "sentence_bad": "Buruz ikasi ez dituztela gaitasun asko garatzen uste dut.", "sentence_good_reorder": "Uste dut buruz ikastean ez dituztela gaitasun asko garatzen.", "sentence_bad_reorder": "Uste dut buruz ikasi ez dituztela gaitasun asko garatzen.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Duela hamabost egun, nik autoa Udal Kiroldegiaren aurrean aparkatuta neukan.", "sentence_bad": "Duela hamabost egun, nik autoa Udal Kiroldegiaren aurrean aparkatuta zenuen.", "sentence_good_reorder": "Duela hamabost egun, nik Udal Kiroldegiaren aurrean aparkatuta neukan autoa.", "sentence_bad_reorder": "Duela hamabost egun, nik Udal Kiroldegiaren aurrean aparkatuta zenuen autoa.", "type": "E2: Aditza"}
{"sentence_good": "Isunak ipintzen jarraitzen dugu?", "sentence_bad": "Isunak ipintzen jarraitzen ditugu?", "sentence_good_reorder": "Jarraitzen dugu isunak ipintzen?", "sentence_bad_reorder": "Jarraitzen dugu isunak ipintzen?", "type": "E2: Aditza"}
{"sentence_good": "Pozten nau zutaz jakiteak.", "sentence_bad": "Pozten nau zutaz jakiteaz.", "sentence_good_reorder": "Zutaz jakitek pozten nau.", "sentence_bad_reorder": "Zutaz jakiteaz pozten nau.", "type": "E1: Deklinabidea"}
{"sentence_good": "Badakit helburua zaila eta handinahia dela, baina nire ustez lortzeko asmoa barneratzen badugu, denon artean lor dezakegu.", "sentence_bad": "Badakit helburua zaila eta handinahia dela, baina nire ustez lortzeko asmoa barneratzen badugu, denon artean lor dezakegula.", "sentence_good_reorder": "Badakit helburua zaila eta handinahia dela, baina nire ustez lortzeko asmoa barneratzen badugu, lor dezakegu denon artean.", "sentence_bad_reorder": "Badakit helburua zaila eta handinahia dela, baina nire ustez lortzeko asmoa barneratzen badugu, lor dezakegula denon artean.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Eta amaitzeko, eskerrak eman nahiko nituzke umeen jolastokiak estaltzeagatik, baina zer gertatzen da nagusien parkeekin?", "sentence_bad": "Eta amaitzeko, eskerrak ematea nahiko nituzke umeen jolastokiak estaltzeagatik, baina zer gertatzen da nagusien parkeekin?", "sentence_good_reorder": "Eta amaitzeko, umeen jolastokiak estaltzeagatik eskerrak eman nahiko nituzke, baina zer gertatzen da nagusien parkeekin?", "sentence_bad_reorder": "Eta amaitzeko, umeen jolastokiak estaltzeagatik eskerrak ematea nahiko nituzke, baina zer gertatzen da nagusien parkeekin?", "type": "E1: Deklinabidea"}
{"sentence_good": "Maiatzean, ordea, eguzkia ia egunero irteten da eta eguraldi epela egiten du.", "sentence_bad": "Maiatzean, ordea, eguzkia ia egunero irten da eta eguraldi epela egiten du.", "sentence_good_reorder": "Maiatzean, ordea, ia egunero irteten da eguzkia eta eguraldi epela egiten du.", "sentence_bad_reorder": "Maiatzean, ordea, ia egunero irten da eguzkia eta eguraldi epela egiten du.", "type": "E2: Aditza"}
{"sentence_good": "Zuk bazeneukan honen berri?", "sentence_bad": "Zuk zeneukan honen berri?", "sentence_good_reorder": "Zuk honen berri bazeneukan?", "sentence_bad_reorder": "Zuk honen berri zeneukan?", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Beraz, baten batek badaki non egin dezakedan txalaparta ikastaro on bat, eskertuko diot.", "sentence_bad": "Beraz, baten batek badaki non egin dezaket txalaparta ikastaro on bat, eskertuko diot.", "sentence_good_reorder": "Beraz, baten batek badaki txalaparta ikastaro on bat non egin dezakedan, eskertuko diot.", "sentence_bad_reorder": "Beraz, baten batek badaki txalaparta ikastaro on bat non egin dezaket, eskertuko diot.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Eta beranduago zure gustuko jatetxean afalduko dugu.", "sentence_bad": "Eta beranduago zure gustokoen jatetxean afalduko dugu.", "sentence_good_reorder": "Eta beranduago afalduko dugu zure gustuko jatetxean.", "sentence_bad_reorder": "Eta beranduago afalduko dugu zure gustokoen jatetxean.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Bistan da gaur egungo elikadurari buruzko informazio guztia aprobetxatu behar dugula.", "sentence_bad": "Bistan da gaur egungo elikadurari buruzko informazio guztia aprobetxatu behar dugunik.", "sentence_good_reorder": "Bistan da elikadurari buruzko gaur egungo informazio guztia aprobetxatu behar dugula.", "sentence_bad_reorder": "Bistan da elikadurari buruzko gaur egungo informazio guztia aprobetxatu behar dugunik.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Afaldu ondoren partida bat jokatuko dugu gure lagunekin herriko tabernan.", "sentence_bad": "Afaldu ondoan partida bat jokatuko dugu gure lagunekin herriko tabernan.", "sentence_good_reorder": "Afaldu ondoren herriko tabernan partida bat jokatuko dugu gure lagunekin.", "sentence_bad_reorder": "Afaldu ondoan herriko tabernan partida bat jokatuko dugu gure lagunekin.", "type": "E1: Deklinabidea"}
{"sentence_good": "Portuko pentsio batean bizi naiz eta itsasoa ikusten dut nire gelatik.", "sentence_bad": "Portuko pentsio batean bizi naiz eta itsasoan ikusten dut nire gelatik.", "sentence_good_reorder": "Portuko pentsio batean bizi naiz eta nire gelatik itsasoa ikusten dut.", "sentence_bad_reorder": "Portuko pentsio batean bizi naiz eta nire gelatik itsasoan ikusten dut.", "type": "E1: Deklinabidea"}
{"sentence_good": "Dena dela, ez urik ez janaririk ez dagoela esan dute.", "sentence_bad": "Dena dela, ez urik ez janaririk ez dago esan dute.", "sentence_good_reorder": "Dena dela, esan dute ez urik ez janaririk ez dagoela.", "sentence_bad_reorder": "Dena dela, esan dute ez urik ez janaririk ez dago.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ziur noizbait entzun duzuela zerbait leku honi buruz!", "sentence_bad": "Ziur noizbait entzun duzu zerbait leku honi buruz!", "sentence_good_reorder": "Ziur noizbait zerbait entzun duzuela leku honi buruz!", "sentence_bad_reorder": "Ziur noizbait zerbait entzun duzu leku honi buruz!", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Interesgarriena glaziarrak eta paisaia ederrak ezagutzea izan da.", "sentence_bad": "Interesgarriena glaziarrak eta paisai ederrak ezagutzea izan da.", "sentence_good_reorder": "Interesgarriena izan da glaziarrak eta paisaia ederrak ezagutzea.", "sentence_bad_reorder": "Interesgarriena izan da glaziarrak eta paisai ederrak ezagutzea.", "type": "E1: Deklinabidea"}
{"sentence_good": "Oso museo ospetsu batean (suposatzen dut ez dela beharrezkoa museoaren izena esatea...) neure burua berotzen hasi zen, eta azkenean, eskaintza onartzea erabaki nuen.", "sentence_bad": "Oso museo ospetsu batean (suposatzen dut ez da beharrezkoa museoaren izena esatea...) neure burua berotzen hasi zen, eta azkenean, erabaki nuen eskaintza onartzea.", "sentence_good_reorder": "Oso museo ospetsu batean (suposatzen dut museoaren izena esatea ez dela beharrezkoa...) neure burua berotzen hasi zen, eta azkenean, eskaintza onartzea erabaki nuen.", "sentence_bad_reorder": "Oso museo ospetsu batean (suposatzen dut museoaren izena esatea ez da beharrezkoa...) neure burua berotzen hasi zen, eta azkenean, erabaki nuen eskaintza onartzea.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Gogoratzen dut, arratsaldeko zazpietatik aurrera, oso jende gutxi zebilela kalean edo hondartzan, eta ez zen erraza afaltzeko jatetxe bat aurkitzea bederatzietatik aurrera.", "sentence_bad": "Gogoratzen dut, arratsaldeko zazpietatik aurrera, oso jende gutxi zebilen kalean edo hondartzan, eta ez zen erraza afaltzeko jatetxe bat aurkitzea bederatzietatik aurrera.", "sentence_good_reorder": "Gogoratzen dut, arratsaldeko zazpietatik aurrera, kalean edo hondartzan oso jende gutxi zebilela, eta ez zen erraza afaltzeko jatetxe bat aurkitzea bederatzietatik aurrera.", "sentence_bad_reorder": "Gogoratzen dut, arratsaldeko zazpietatik aurrera, kalean edo hondartzan oso jende gutxi zebilen, eta ez zen erraza afaltzeko jatetxe bat aurkitzea bederatzietatik aurrera.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Era berean, kezkagarria da munduan milioika pertsona gosez hiltzen diren bitartean, egunero milaka kilo elikagai alferrik galtzea.", "sentence_bad": "Era berean, kezkagarria da munduan milioika pertsona gosez hiltzen diren bitartean, egunero milaka kilo elikagai alferrik galtzen direla.", "sentence_good_reorder": "Era berean, kezkagarria da munduan milioika pertsona gosez hiltzen diren bitartean, milaka kilo elikagai alferrik galtzea egunero.", "sentence_bad_reorder": "Era berean, kezkagarria da munduan milioika pertsona gosez hiltzen diren bitartean, milaka kilo elikagai alferrik galtzen direla egunero.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Sei hilabete hauetan teknikaria lau aldiz etorri da konpontzera.", "sentence_bad": "Sei hilabete honetan teknikaria lau aldiz etorri da konpontzera.", "sentence_good_reorder": "Teknikaria lau aldiz etorri da konpontzera sei hilabete hauetan.", "sentence_bad_reorder": "Teknikaria lau aldiz etorri da konpontzera sei hilabete honetan.", "type": "E1: Deklinabidea"}
{"sentence_good": "Umeek buruan hatz egiten dutela ikusten baduzue, zorriak dituzten seinale.", "sentence_bad": "Umeek burua hatz egiten dutela ikusten baduzue, zorriak dituzten seinale.", "sentence_good_reorder": "Ikusten baduzue umeek buruan hatz egiten dutela, zorriak dituzten seinale.", "sentence_bad_reorder": "Ikusten baduzue umeek burua hatz egiten dutela, zorriak dituzten seinale.", "type": "E1: Deklinabidea"}
{"sentence_good": "Polikiroldegia eta liburutegia ditugun arren, ordutegiak ez dira zabalak, biak eguerdian itxita daude eta abuztuan ere bai; horrez gain, liburutegiak asteburuetan ez du irekitzen.", "sentence_bad": "Polikiroldegia eta liburutegia ditugun arren, ordutegiak ez dira zabalak, biak eguerdian itxita daude eta abuztuan ere bai; horrez gain, liburutegiak astebururik ez du irekitzen.", "sentence_good_reorder": "Polikiroldegia eta liburutegia ditugun arren, ordutegiak ez dira zabalak, biak eguerdian itxita daude eta abuztuan ere bai; horrez gain, liburutegiak ez du irekitzen asteburuetan.", "sentence_bad_reorder": "Polikiroldegia eta liburutegia ditugun arren, ordutegiak ez dira zabalak, biak eguerdian itxita daude eta abuztuan ere bai; horrez gain, liburutegiak ez du irekitzen astebururik.", "type": "E1: Deklinabidea"}
{"sentence_good": "Atezainak esan zidanaren arabera, zentroaren fatxadak loseta batzuk solte zeuzkan eta hormigoi zati bat jausi egin zen justu-justuan nire autoaren gainean.", "sentence_bad": "Atezainak esan zidanez arabera, zentroaren fatxadak loseta batzuk solte zeuzkan eta hormigoi zati bat jausi egin zen justu-justuan nire autoaren gainean.", "sentence_good_reorder": "Atezainak esan zidanaren arabera, zentroaren fatxadak solte zeuzkan loseta batzuk eta hormigoi zati bat jausi egin zen justu-justuan nire autoaren gainean.", "sentence_bad_reorder": "Atezainak esan zidanez arabera, zentroaren fatxadak solte zeuzkan loseta batzuk eta hormigoi zati bat jausi egin zen justu-justuan nire autoaren gainean.", "type": "E1: Deklinabidea"}
{"sentence_good": "Niretzat garrantzitsua da motxila aurkitzea nire klaseko gauza guztiak barruan dauzkat eta, gainera gauza horiek berriak dira eta ezinezkoa da nire gurasoei esatea berriro erosteko.", "sentence_bad": "Niretzat garrantzitsu da motxila aurkitzea nire klaseko gauza guztiak barruan dauzkat eta, gainera gauza horiek berriak dira eta ezinezkoa da nire gurasoei esatea berriro erosteko.", "sentence_good_reorder": "Niretzat garrantzitsua da motxila aurkitzea barruan dauzkat nire klaseko gauza guztiak eta, gainera gauza horiek berriak dira eta ezinezkoa da nire gurasoei esatea berriro erosteko.", "sentence_bad_reorder": "Niretzat garrantzitsu da motxila aurkitzea barruan dauzkat nire klaseko gauza guztiak eta, gainera gauza horiek berriak dira eta ezinezkoa da nire gurasoei esatea berriro erosteko.", "type": "E1: Deklinabidea"}
{"sentence_good": "Apirilean berriro hasiko dira eta gomendatzen dizut etortzea.", "sentence_bad": "Apirilaren berriro hasiko dira eta gomendatzen dizut etortzea.", "sentence_good_reorder": "Apirilean berriro hasiko dira eta etortzea gomendatzen dizut.", "sentence_bad_reorder": "Apirilaren berriro hasiko dira eta etortzea gomendatzen dizut.", "type": "E1: Deklinabidea"}
{"sentence_good": "Martxoan, haize handia ibiltzen da, eta noizbehinka zaparrada izugarria egiten du.", "sentence_bad": "Martxoan, haize handia ibiltzen da, eta noizbehinka zaparrada izugarri egiten du.", "sentence_good_reorder": "Martxoan, haize handia ibiltzen da, eta zaparrada izugarria egiten du noizbehinka.", "sentence_bad_reorder": "Martxoan, haize handia ibiltzen da, eta zaparrada izugarri egiten du noizbehinka.", "type": "E1: Deklinabidea"}
{"sentence_good": "Egia esan, ez da erraza esatea nork daukan arrazoia.", "sentence_bad": "Egia esan, ez da erraza esatea nork dauka arrazoia.", "sentence_good_reorder": "Egia esan, ez da erraza esatea arrazoia nork daukan.", "sentence_bad_reorder": "Egia esan, ez da erraza esatea arrazoia nork dauka.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Honek, ospitalearen jokabidea azaltzeko aukera ematen digu irakurle eta erabiltzaile gehiagorengana iritsiz.", "sentence_bad": "Honek, ospitalearen jokabidea azaltzeko aukera ematen digu irakurle eta erabiltzaile gehiagori iritsiz.", "sentence_good_reorder": "Honek, aukera ematen digu ospitalearen jokabidea azaltzeko irakurle eta erabiltzaile gehiagorengana iritsiz.", "sentence_bad_reorder": "Honek, aukera ematen digu ospitalearen jokabidea azaltzeko irakurle eta erabiltzaile gehiagori iritsiz.", "type": "E1: Deklinabidea"}
{"sentence_good": "Eta zu betidanik sasoian egon zara.", "sentence_bad": "Eta zu betidanik sasoian zaude.", "sentence_good_reorder": "Eta zu sasoian egon zara betidanik.", "sentence_bad_reorder": "Eta zu sasoian zaude betidanik.", "type": "E2: Aditza"}
{"sentence_good": "Zuri kontatuko dizut dena.", "sentence_bad": "Zuri kontatuko dut dena.", "sentence_good_reorder": "Zuri dena kontatuko dizut.", "sentence_bad_reorder": "Zuri dena kontatuko dut.", "type": "E2: Aditza"}
{"sentence_good": "Orain ez naiz lanera joaten, enpresak ia-ia bakarrik funtzionatzen duelako.", "sentence_bad": "Orain ez naiz lanera joaten, enpresa ia-ia bakarrik funtzionatzen duelako.", "sentence_good_reorder": "Orain ez naiz lanera joaten, ia-ia bakarrik funtzionatzen duelako enpresak.", "sentence_bad_reorder": "Orain ez naiz lanera joaten, ia-ia bakarrik funtzionatzen duelako enpresa.", "type": "E1: Deklinabidea"}
{"sentence_good": "Oso ondo egongo zarela espero dut.", "sentence_bad": "Oso ondo egongo zara espero dut.", "sentence_good_reorder": "Espero dut oso ondo egongo zarela.", "sentence_bad_reorder": "Espero dut oso ondo egongo zara.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Oso ondo dago mendiak gure parke nagusia izatea, baina sarrerak ez dira onak eta kontuz ibili.", "sentence_bad": "Oso ondo dago mendiak gure parke nagusia direla, baina sarrerak ez dira onak eta kontuz ibili.", "sentence_good_reorder": "Mendiak gure parke nagusia izatea oso ondo dago, baina sarrerak ez dira onak eta kontuz ibili.", "sentence_bad_reorder": "Mendiak gure parke nagusia direla oso ondo dago, baina sarrerak ez dira onak eta kontuz ibili.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Nahiz eta umeek beti bezala jarraitzen duten, gurasoen artean egoera ez da batere atsegina.", "sentence_bad": "Nahiz eta umeak beti bezala jarraitzen duten, gurasoen artean egoera ez da batere atsegina.", "sentence_good_reorder": "Nahiz eta umeek beti bezala jarraitzen duten, egoera ez da batere atsegina gurasoen artean.", "sentence_bad_reorder": "Nahiz eta umeak beti bezala jarraitzen duten, egoera ez da batere atsegina gurasoen artean.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ondorioz, nik esan nahi nuke teknika modernoek jakien produkzioa bakarrik gehitzen dutela, baina kalitatea gutxitzen dute.", "sentence_bad": "Ondorioz, nik esan nahi nuke teknika modernoak jakien produkzioa bakarrik gehitzen dutela, baina kalitatea gutxitzen dute.", "sentence_good_reorder": "Ondorioz, teknika modernoek jakien produkzioa bakarrik gehitzen dutela esan nahi nuke nik, baina kalitatea gutxitzen dute.", "sentence_bad_reorder": "Ondorioz, teknika modernoak jakien produkzioa bakarrik gehitzen dutela esan nahi nuke nik, baina kalitatea gutxitzen dute.", "type": "E1: Deklinabidea"}
{"sentence_good": "Esan dudanaz gain, ez daukagu liburutegirik ere, eta hau oso garrantzitsua dela iruditzen zait.", "sentence_bad": "Esan dudanaz gain, ez daukagu liburutegirik ere, eta hau oso garrantzitsua da iruditzen zait.", "sentence_good_reorder": "Esan dudanaz gain, liburutegirik ere ez daukagu, eta hau oso garrantzitsua dela iruditzen zait.", "sentence_bad_reorder": "Esan dudanaz gain, liburutegirik ere ez daukagu, eta hau oso garrantzitsua da iruditzen zait.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Lantokia ez dago oso urrun, egunero trenez joaten naiz.", "sentence_bad": "Lantokia ez da oso urrun, egunero trenez joaten naiz.", "sentence_good_reorder": "Lantokia ez dago oso urrun, trenez joaten naiz egunero.", "sentence_bad_reorder": "Lantokia ez da oso urrun, trenez joaten naiz egunero.", "type": "E2: Aditza"}
{"sentence_good": "Bera oso pozik egon zen eta aurten ere joango da leku berberera.", "sentence_bad": "Bera oso pozik egon zen eta aurten ere joango da leku berbera.", "sentence_good_reorder": "Bera oso pozik egon zen eta aurten ere leku berberera joango da.", "sentence_bad_reorder": "Bera oso pozik egon zen eta aurten ere leku berbera joango da.", "type": "E1: Deklinabidea"}
{"sentence_good": "Enpresa batzuekin lan egiten dugu eta uste dut emaitzak lortuko ditugula.", "sentence_bad": "Enpresa batzuekin lan egiten dugu eta uste dut emaitzak lortuko ditugu.", "sentence_good_reorder": "Enpresa batzuekin lan egiten dugu eta emaitzak lortuko ditugula uste dut.", "sentence_bad_reorder": "Enpresa batzuekin lan egiten dugu eta emaitzak lortuko ditugu uste dut.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Garraiobide publikoa adibidez, ez da auzo guztietara heltzen eta auzokide gehienek autobus publikoa hartzeko, autoa erabili behar izaten dute autobusaren geltokiraino iristeko.", "sentence_bad": "Garraiobide publikoa adibidez, ez da auzo guztietara heltzen eta auzokide gehienek autobusa publikoa hartzeko, autoa erabili behar izaten dute autobusaren geltokiraino iristeko.", "sentence_good_reorder": "Garraiobide publikoa adibidez, ez da heltzen auzo guztietara eta auzokide gehienek autobus publikoa hartzeko, autoa erabili behar izaten dute autobusaren geltokiraino iristeko.", "sentence_bad_reorder": "Garraiobide publikoa adibidez, ez da heltzen auzo guztietara eta auzokide gehienek autobusa publikoa hartzeko, autoa erabili behar izaten dute autobusaren geltokiraino iristeko.", "type": "E1: Deklinabidea"}
{"sentence_good": "Umeak oso atseginak dira!", "sentence_bad": "Umeek oso atseginak dira!", "sentence_good_reorder": "Oso atseginak dira umeak!", "sentence_bad_reorder": "Oso atseginak dira umeek!", "type": "E1: Deklinabidea"}
{"sentence_good": "Nire motxila larruzkoa eta berde kolorekoa zen.", "sentence_bad": "Nire motxila larruzkoa eta koloretako berdea zen.", "sentence_good_reorder": "Larruzkoa eta berde kolorekoa zen nire motxila.", "sentence_bad_reorder": "Larruzkoa eta koloretako berdea zen nire motxila.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ez dut erantzunik espero, baina eskutitz honek pixka bat pentsa dezazuen balio izan badu pozik egongo naiz.", "sentence_bad": "Ez dut erantzunik espero, baina eskutitz honek pixka bat pentsa dezazuen balio izan badu pozik egoten naiz.", "sentence_good_reorder": "Ez dut erantzunik espero, baina pozik egongo naiz eskutitz honek pixka bat pentsa dezazuen balio izan badu.", "sentence_bad_reorder": "Ez dut erantzunik espero, baina pozik egoten naiz eskutitz honek pixka bat pentsa dezazuen balio izan badu.", "type": "E2: Aditza"}
{"sentence_good": "Horrexegatik, artikulu honetan nire iritzia ematea gustatuko litzaidake.", "sentence_bad": "Horrexegatik, artikulu hontan nire iritzia ematea gustatuko litzaidake.", "sentence_good_reorder": "Horrexegatik, gustatuko litzaidake artikulu honetan nire iritzia ematea.", "sentence_bad_reorder": "Horrexegatik, gustatuko litzaidake artikulu hontan nire iritzia ematea.", "type": "E1: Deklinabidea"}
{"sentence_good": "Zalantzarik baduzue, mesedez, galde ezazue.", "sentence_bad": "Zalantzarik badituzuen, mesedez, galde ezazue.", "sentence_good_reorder": "Mesedez, zalantzarik baduzue, galde ezazue.", "sentence_bad_reorder": "Mesedez, zalantzarik badituzuen, galde ezazue.", "type": "E2: Aditza"}
{"sentence_good": "Oso kaltetuta amaitzea erraza bada ere, guk ondo eutsi genion hurrengo eguneko jai handiari.", "sentence_bad": "Oso kaltetuta amaitzea erraza bada ere, guk ondo eutsi genuen hurrengo eguneko jai handiari.", "sentence_good_reorder": "Oso kaltetuta amaitzea erraza bada ere, guk hurrengo eguneko jai handiari ondo eutsi genion.", "sentence_bad_reorder": "Oso kaltetuta amaitzea erraza bada ere, guk hurrengo eguneko jai handiari ondo eutsi genuen.", "type": "E2: Aditza"}
{"sentence_good": "Hasteko, esan behar dut urtero gauza politak prestatzen ditugula eta orokorrean, ekimenaren giroa oso ona dela, nik uste.", "sentence_bad": "Hasteko, esan behar dut urtero gauza politak prestatzen ditugu eta orokorrean, ekimenaren giroa oso ona dela, nik uste.", "sentence_good_reorder": "Hasteko, esan behar dut gauza politak prestatzen ditugula urtero eta orokorrean, ekimenaren giroa oso ona dela, nik uste.", "sentence_bad_reorder": "Hasteko, esan behar dut gauza politak prestatzen ditugu urtero eta orokorrean, ekimenaren giroa oso ona dela, nik uste.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Aurten Unaxek 9 urte beteko dituenez, ideia ona iruditzen zait udalekuetan apuntatzea.", "sentence_bad": "Aurten Unaxek 9 urte beteko duenez, ideia ona iruditzen zait udalekuetan apuntatzea.", "sentence_good_reorder": "Aurten Unaxek 9 urte beteko dituenez, udalekuetan apuntatzea ideia ona iruditzen zait.", "sentence_bad_reorder": "Aurten Unaxek 9 urte beteko duenez, udalekuetan apuntatzea ideia ona iruditzen zait.", "type": "E2: Aditza"}
{"sentence_good": "Adibidez, Lekeition hasieran antzarak bizirik erabiltzen zituzten, ondoren hilik zeuden eta orain plastikozkoak dira.", "sentence_bad": "Adibidez, Lekeition hasieran antzara bizirik erabiltzen zituzten, ondoren hilik zeuden eta orain plastikozkoak dira.", "sentence_good_reorder": "Adibidez, Lekeition hasieran bizirik erabiltzen zituzten antzara, ondoren hilik zeuden eta orain plastikozkoak dira.", "sentence_bad_reorder": "Adibidez, Lekeition hasieran bizirik erabiltzen zituzten antzara, ondoren hilik zeuden eta orain plastikozkoak dira.", "type": "E1: Deklinabidea"}
{"sentence_good": "Agur eta laster ikustea espero dut.", "sentence_bad": "Agur eta laster ikusi espero dut.", "sentence_good_reorder": "Agur eta espero dut laster ikustea.", "sentence_bad_reorder": "Agur eta espero dut laster ikusi.", "type": "E1: Deklinabidea"}
{"sentence_good": "Larunbatean jatetxe batera joan ahal gara bazkaltzera.", "sentence_bad": "Larunbatean jatetxea batera joan ahal gara bazkaltzera.", "sentence_good_reorder": "Jatetxe batera joan ahal larunbatean gara bazkaltzera.", "sentence_bad_reorder": "Jatetxea batera joan ahal larunbatean gara bazkaltzera.", "type": "E1: Deklinabidea"}
{"sentence_good": "Adibidez, nire klasean hogeita hamabost ikasle ginen eta irakasleak hitz egiten zuenean, denok isilik geunden, hala ere, gaur egun horrelako gauzak ikustea ezinezkoa da.", "sentence_bad": "Adibidez, nire klasean hogeita hamabost ikasleak ginen eta irakasleak hitz egiten zuenean, denok isilik geunden, hala ere, gaur egun horrelako gauzak ikustea ezinezkoa da.", "sentence_good_reorder": "Adibidez, hogeita hamabost ikasle ginen nire klasean eta irakasleak hitz egiten zuenean, denok isilik geunden, hala ere, gaur egun horrelako gauzak ikustea ezinezkoa da.", "sentence_bad_reorder": "Adibidez, hogeita hamabost ikasleak ginen nire klasean eta irakasleak hitz egiten zuenean, denok isilik geunden, hala ere, gaur egun horrelako gauzak ikustea ezinezkoa da.", "type": "E1: Deklinabidea"}
{"sentence_good": "Ziur nago badakizula zer gertatu zen, baina kontatuko dizut irakurri nuen berria.", "sentence_bad": "Ziur nago badakizula zer gertatu zela, baina kontatuko dizut irakurri nuen berria.", "sentence_good_reorder": "Ziur nago zer gertatu zen badakizula, baina kontatuko dizut irakurri nuen berria.", "sentence_bad_reorder": "Ziur nago zer gertatu zela badakizula, baina kontatuko dizut irakurri nuen berria.", "type": "E3: Egitura eta ordena"}
{"sentence_good": "Ziur nago hainbeste informazio jaso eta gero, pertsonalki ezagutzera etorri nahi duzula.", "sentence_bad": "Ziur nago hainbeste informazioa jaso eta gero, pertsonalki ezagutzera etorri nahi duzula.", "sentence_good_reorder": "Ziur nago hainbeste informazio jaso eta gero, etorri nahi duzula pertsonalki ezagutzera.", "sentence_bad_reorder": "Ziur nago hainbeste informazioa jaso eta gero, etorri nahi duzula pertsonalki ezagutzera.", "type": "E1: Deklinabidea"}
{"sentence_good": "Badakit ez dela beharrezkoa, baina ni oso urduria naiz eta gustatzen zait medikuarengana joatea.", "sentence_bad": "Badakit ez dela beharrezkoa, baina ni oso urduri naiz eta gustatzen zait medikuarengana joatea.", "sentence_good_reorder": "Badakit ez dela beharrezkoa, baina ni oso urduria naiz eta medikuarengana joatea gustatzen zait.", "sentence_bad_reorder": "Badakit ez dela beharrezkoa, baina ni oso urduri naiz eta medikuarengana joatea gustatzen zait.", "type": "E1: Deklinabidea"}
{"sentence_good": "Kontatuko dudan hau duela bost urte gertatu zen.", "sentence_bad": "Hau kontatuko dudan duela bost urte gertatu zen.", "sentence_good_reorder": "Duela bost urte gertatu zen kontatuko dudan hau.", "sentence_bad_reorder": "Duela bost urte gertatu zen hau kontatuko dudan.", "type": "E3: Egitura eta ordena"}
